const JLPT_KANJI_STRINGS = {
  N5: "一 七 万 三 上 下 中 九 二 五 人 今 休 何 先 入 八 六 円 出 分 前 北 十 千 午 半 南 友 右 名 四 国 土 外 大 天 女 子 学 小 山 川 左 年 後 日 時 書 月 木 本 来 東 校 母 毎 気 水 火 父 生 男 白 百 聞 行 西 見 話 語 読 車 金 長 間 雨 電 食 高",
  N4: "不 世 主 事 京 仕 代 以 会 住 体 作 使 借 元 兄 公 写 冬 切 別 力 勉 動 医 去 口 古 台 同 味 品 員 問 図 地 堂 場 売 夏 夕 多 夜 妹 姉 始 字 安 室 家 少 屋 工 帰 広 店 度 建 弟 強 待 心 思 急 悪 意 手 持 教 文 料 新 方 旅 族 早 明 映 春 昼 曜 有 服 朝 業 楽 歌 止 正 歩 死 注 洋 海 漢 牛 物 特 犬 理 用 田 町 画 界 病 発 的 目 真 着 知 研 社 私 秋 究 空 立 答 紙 終 習 考 者 肉 自 色 花 英 茶 親 言 計 試 買 貸 質 赤 走 起 足 転 近 送 通 週 運 道 重 野 銀 開 院 集 青 音 題 風 飯 飲 館 駅 験 魚 鳥 黒",
  N3: "与 両 乗 予 争 互 亡 交 他 付 件 任 伝 似 位 余 例 供 便 係 信 倒 候 値 偉 側 偶 備 働 優 光 全 共 具 内 冷 処 列 初 判 利 到 制 刻 割 加 助 努 労 務 勝 勤 化 単 危 原 参 反 収 取 受 可 号 合 向 君 否 吸 吹 告 呼 命 和 商 喜 回 因 困 園 在 報 増 声 変 夢 太 夫 失 好 妻 娘 婚 婦 存 宅 守 完 官 定 実 客 害 容 宿 寄 富 寒 寝 察 対 局 居 差 市 師 席 常 平 幸 幾 座 庭 式 引 当 形 役 彼 徒 得 御 必 忘 忙 念 怒 怖 性 恐 恥 息 悲 情 想 愛 感 慣 成 戦 戻 所 才 打 払 投 折 抜 抱 押 招 指 捕 掛 探 支 放 政 敗 散 数 断 易 昔 昨 晩 景 晴 暗 暮 曲 更 最 望 期 未 末 束 杯 果 格 構 様 権 横 機 欠 次 欲 歯 歳 残 段 殺 民 求 決 治 法 泳 洗 活 流 浮 消 深 済 渡 港 満 演 点 然 煙 熱 犯 状 猫 王 現 球 産 由 申 留 番 疑 疲 痛 登 皆 盗 直 相 眠 石 破 確 示 礼 祖 神 福 科 程 種 積 突 窓 笑 等 箱 米 精 約 組 経 給 絵 絶 続 緒 罪 置 美 老 耳 職 育 背 能 腹 舞 船 良 若 苦 草 落 葉 薬 術 表 要 規 覚 観 解 記 訪 許 認 誤 説 調 談 論 識 警 議 負 財 貧 責 費 資 賛 越 路 身 辞 込 迎 返 迷 追 退 逃 途 速 連 進 遅 遊 過 達 違 遠 適 選 部 都 配 酒 閉 関 阪 降 限 除 険 陽 際 雑 難 雪 静 非 面 靴 頂 頭 頼 顔 願 類 飛 首 馬 髪 鳴",
  N2: "並 丸 久 乱 乳 乾 了 介 仏 令 仲 伸 伺 低 依 個 倍 停 傾 像 億 兆 児 党 兵 冊 再 凍 刊 刷 券 刺 則 副 劇 効 勇 募 勢 包 匹 区 卒 協 占 印 卵 厚 双 叫 召 史 各 含 周 咲 喫 営 団 囲 固 圧 坂 均 型 埋 城 域 塔 塗 塩 境 央 奥 姓 委 季 孫 宇 宝 寺 封 専 将 尊 導 届 層 岩 岸 島 州 巨 巻 布 希 帯 帽 幅 干 幼 庁 床 底 府 庫 延 弱 律 復 快 恋 患 悩 憎 戸 承 技 担 拝 拾 挟 捜 捨 掃 掘 採 接 換 損 改 敬 旧 昇 星 普 暴 曇 替 札 机 材 村 板 林 枚 枝 枯 柔 柱 査 栄 根 械 棒 森 植 極 橋 欧 武 歴 殿 毒 比 毛 氷 永 汗 汚 池 沈 河 沸 油 況 泉 泊 波 泥 浅 浴 涙 液 涼 混 清 減 温 測 湖 湯 湾 湿 準 溶 滴 漁 濃 濯 灯 灰 炭 無 焼 照 燃 燥 爆 片 版 玉 珍 瓶 甘 畜 略 畳 療 皮 皿 省 県 短 砂 硬 磨 祈 祝 祭 禁 秒 移 税 章 童 競 竹 符 筆 筒 算 管 築 簡 籍 粉 粒 糸 紅 純 細 紹 絡 綿 総 緑 線 編 練 績 缶 署 群 羽 翌 耕 肌 肩 肯 胃 胸 脂 脳 腕 腰 膚 臓 臣 舟 航 般 芸 荒 荷 菓 菜 著 蒸 蔵 薄 虫 血 衣 袋 被 装 裏 補 複 角 触 訓 設 詞 詰 誌 課 諸 講 谷 豊 象 貝 貨 販 貯 貿 賞 賢 贈 超 跡 踊 軍 軒 軟 軽 輪 輸 辛 農 辺 述 逆 造 郊 郵 量 針 鈍 鉄 鉱 銅 鋭 録 門 防 陸 隅 階 隻 雇 雲 零 震 革 順 預 領 額 香 駐 骨 麦 黄 鼻 齢",
  N1: "丁 丑 且 丘 丙 丞 丹 乃 之 乏 乙 也 亀 井 亘 亜 亥 亦 亨 享 亭 亮 仁 仙 仮 仰 企 伊 伍 伎 伏 伐 伯 伴 伶 伽 但 佐 佑 佳 併 侃 侍 侑 価 侮 侯 侵 促 俊 俗 保 修 俳 俵 俸 倉 倖 倣 倫 倭 倹 偏 健 偲 偵 偽 傍 傑 傘 催 債 傷 僕 僚 僧 儀 儒 償 允 充 克 免 典 兼 冒 冗 冠 冴 冶 准 凌 凜 凝 凡 凪 凱 凶 凸 凹 刀 刃 刈 刑 削 剖 剛 剣 剤 剰 創 功 劣 励 劾 勁 勅 勘 勧 勲 勺 匁 匠 匡 匿 升 卑 卓 博 卯 即 却 卸 厄 厘 厳 又 及 叔 叙 叡 句 只 叶 司 吉 后 吏 吐 吟 呂 呈 呉 哀 哉 哲 唄 唆 唇 唯 唱 啄 啓 善 喚 喝 喪 喬 嗣 嘆 嘉 嘱 器 噴 嚇 囚 圏 圭 坑 坪 垂 垣 執 培 基 堀 堅 堕 堤 堪 塀 塁 塊 塑 塚 塾 墓 墜 墨 墳 墾 壁 壇 壊 壌 士 壮 壱 奇 奈 奉 奎 奏 契 奔 奨 奪 奮 奴 如 妃 妄 妊 妙 妥 妨 姫 姻 姿 威 娠 娯 婆 婿 媒 媛 嫁 嫌 嫡 嬉 嬢 孔 孝 孟 孤 宏 宗 宙 宜 宣 宥 宮 宰 宴 宵 寂 寅 密 寛 寡 寧 審 寮 寸 射 尉 尋 尚 尭 就 尺 尼 尽 尾 尿 屈 展 属 履 屯 岐 岡 岬 岳 峠 峡 峰 峻 崇 崎 崚 崩 嵐 嵩 嵯 嶺 巌 巡 巣 巧 己 巳 巴 巽 帆 帝 帥 帳 幕 幣 幹 幻 幽 庄 序 庶 康 庸 廃 廉 廊 廷 弁 弊 弐 弓 弔 弘 弥 弦 弧 張 弾 彗 彦 彩 彪 彫 彬 彰 影 往 征 径 徐 従 循 微 徳 徴 徹 忌 忍 志 応 忠 怜 怠 怪 恒 恕 恨 恩 恭 恵 悌 悔 悟 悠 悦 悼 惇 惑 惜 惟 惣 惨 惰 愁 愉 愚 慈 態 慎 慕 慢 慧 慨 慮 慰 慶 憂 憤 憧 憩 憲 憶 憾 懇 懐 懲 懸 我 戒 戯 房 扇 扉 扱 扶 批 抄 把 抑 抗 択 披 抵 抹 抽 拍 拐 拒 拓 拘 拙 拠 拡 括 拳 拷 挑 挙 振 挿 据 捷 捺 授 掌 排 控 推 措 掲 描 提 揚 握 揮 援 揺 搬 搭 携 搾 摂 摘 摩 撃 撤 撮 撲 擁 操 擦 擬 攻 故 敏 救 敢 敦 整 敵 敷 斉 斎 斐 斗 斜 斤 斥 於 施 旋 旗 既 旦 旨 旬 旭 旺 昂 昆 昌 昭 是 昴 晃 晋 晏 晟 晨 晶 智 暁 暇 暉 暑 暖 暢 暦 暫 曙 曹 朋 朔 朕 朗 朱 朴 朽 杉 李 杏 杜 条 松 析 枠 枢 架 柄 柊 某 染 柚 柳 柾 栓 栗 栞 株 核 栽 桂 桃 案 桐 桑 桜 桟 梅 梓 梢 梧 梨 棄 棋 棚 棟 棺 椋 椎 検 椰 椿 楊 楓 楠 楼 概 榛 槙 槻 槽 標 模 樹 樺 橘 檀 欄 欣 欺 欽 款 歓 殉 殊 殖 殴 殻 毅 毬 氏 汁 汐 江 汰 汽 沖 沙 没 沢 沼 沿 泌 泡 泣 泰 洞 津 洪 洲 洵 洸 派 浄 浜 浦 浩 浪 浸 涯 淑 淡 淳 添 渇 渉 渋 渓 渚 渥 渦 湧 源 溝 滅 滉 滋 滑 滝 滞 漂 漆 漏 漠 漫 漬 漱 漸 潔 潜 潟 潤 潮 澄 澪 激 濁 濫 瀬 災 炉 炊 炎 為 烈 焦 煩 煮 熊 熙 熟 燎 燦 燿 爵 爽 爾 牧 牲 犠 狂 狙 狩 独 狭 猛 猟 猪 献 猶 猿 獄 獣 獲 玄 率 玖 玲 珠 班 琉 琢 琳 琴 瑚 瑛 瑞 瑠 瑳 瑶 璃 環 甚 甫 甲 畔 畝 異 疎 疫 疾 症 痘 痢 痴 癒 癖 皇 皐 皓 盆 益 盛 盟 監 盤 盲 盾 眉 看 眸 眺 眼 睡 督 睦 瞬 瞭 瞳 矛 矢 矯 砕 砲 硝 硫 碁 碑 碧 碩 磁 磯 礁 礎 祉 祐 祥 票 禄 禅 禍 禎 秀 秘 租 秦 秩 称 稀 稔 稚 稜 稲 稼 稿 穀 穂 穏 穣 穫 穴 窃 窒 窮 窯 竜 竣 端 笙 笛 第 笹 筋 策 箇 節 範 篤 簿 粋 粗 粘 粛 糖 糧 系 糾 紀 紋 納 紗 紘 級 紛 素 紡 索 紫 紬 累 紳 紺 絃 結 絞 絢 統 絹 継 綜 維 綱 網 綸 綺 綾 緊 緋 締 緩 緯 縁 縄 縛 縦 縫 縮 繁 繊 織 繕 繭 繰 罰 罷 羅 羊 義 翁 翔 翠 翻 翼 耀 耐 耗 耶 聖 聡 聴 肇 肖 肝 肢 肥 肪 肺 胆 胎 胞 胡 胤 胴 脅 脈 脚 脩 脱 脹 腐 腸 膜 膨 臨 臭 至 致 興 舌 舎 舗 舜 舶 艇 艦 艶 芋 芙 芝 芳 芹 芽 苑 苗 茂 茄 茅 茉 茎 茜 荘 莉 莞 菊 菌 菖 菫 華 萌 萩 葬 葵 蒔 蒼 蓄 蓉 蓮 蔦 蕉 蕗 薦 薪 薫 藍 藤 藩 藻 蘭 虎 虐 虚 虜 虞 虹 蚊 蚕 蛇 蛍 蛮 蝶 融 衆 街 衛 衝 衡 衰 衷 衿 袈 裁 裂 裕 裟 裸 製 褐 褒 襟 襲 覆 覇 視 覧 訂 討 託 訟 訳 訴 診 証 詐 詔 評 詠 詢 詩 該 詳 誇 誉 誓 誕 誘 誠 誼 諄 請 諒 諭 諮 諾 謀 謁 謄 謙 謝 謡 謹 譜 譲 護 豆 豚 豪 貞 貢 貫 貴 賀 賃 賄 賊 賓 賜 賠 賦 購 赦 赳 赴 趣 距 跳 践 踏 躍 軌 軸 較 載 輔 輝 輩 轄 辰 辱 迅 迪 迫 迭 透 逐 逓 逝 逮 逸 遂 遇 遍 遣 遥 遭 遮 遵 遷 遺 遼 避 還 邑 那 邦 邪 邸 郁 郎 郡 郭 郷 酉 酌 酔 酢 酪 酬 酵 酷 酸 醜 醸 采 釈 釣 鈴 鉛 鉢 銃 銑 銘 銭 鋳 鋼 錘 錠 錦 錬 錯 鍛 鎌 鎖 鎮 鏡 鐘 鑑 閑 閣 閥 閲 闘 阻 阿 附 陛 陣 陥 陪 陰 陳 陵 陶 隆 隊 随 隔 障 隠 隣 隷 隼 雄 雅 雌 雛 離 雰 雷 需 霊 霜 霞 霧 露 靖 鞠 韻 響 項 須 頌 頑 頒 頻 顕 顧 颯 飢 飼 飽 飾 養 餓 馨 駄 駆 駒 駿 騎 騒 騰 驚 髄 鬼 魁 魂 魅 魔 鮎 鮮 鯉 鯛 鯨 鳩 鳳 鴻 鵬 鶏 鶴 鷹 鹿 麗 麟 麻 麿 黎 黙 黛 鼓",
};

const KANKEN_KANJI_STRINGS = {
  "10급":
    "一 七 三 上 下 中 九 二 五 人 休 先 入 八 六 円 出 力 十 千 口 右 名 四 土 夕 大 天 女 子 字 学 小 山 川 左 年 手 文 日 早 月 木 本 村 林 校 森 正 気 水 火 犬 玉 王 生 田 男 町 白 百 目 石 空 立 竹 糸 耳 花 草 虫 見 貝 赤 足 車 金 雨 青 音",
  "9급":
    "万 丸 交 京 今 会 体 何 作 元 兄 光 公 内 冬 刀 分 切 前 北 午 半 南 原 友 古 台 合 同 回 図 国 園 地 場 声 売 夏 外 多 夜 太 妹 姉 室 家 寺 少 岩 工 市 帰 広 店 弓 引 弟 弱 強 当 形 後 心 思 戸 才 教 数 新 方 明 星 春 昼 時 晴 曜 書 朝 来 東 楽 歌 止 歩 母 毎 毛 池 汽 活 海 点 父 牛 理 用 画 番 直 矢 知 社 秋 科 答 算 米 紙 細 組 絵 線 羽 考 聞 肉 自 船 色 茶 行 西 親 角 言 計 記 話 語 読 谷 買 走 近 通 週 道 遠 里 野 長 門 間 雪 雲 電 頭 顔 風 食 首 馬 高 魚 鳥 鳴 麦 黄 黒",
  "8급":
    "丁 世 両 主 乗 予 事 仕 他 代 住 使 係 倍 全 具 写 列 助 勉 動 勝 化 区 医 去 反 取 受 号 向 君 味 命 和 品 員 商 問 坂 央 始 委 守 安 定 実 客 宮 宿 寒 対 局 屋 岸 島 州 帳 平 幸 度 庫 庭 式 役 待 急 息 悪 悲 想 意 感 所 打 投 拾 持 指 放 整 旅 族 昔 昭 暑 暗 曲 有 服 期 板 柱 根 植 業 様 横 橋 次 歯 死 氷 決 油 波 注 泳 洋 流 消 深 温 港 湖 湯 漢 炭 物 球 由 申 界 畑 病 発 登 皮 皿 相 県 真 着 短 研 礼 神 祭 福 秒 究 章 童 笛 第 筆 等 箱 級 終 緑 練 羊 美 習 者 育 苦 荷 落 葉 薬 血 表 詩 調 談 豆 負 起 路 身 転 軽 農 返 追 送 速 進 遊 運 部 都 配 酒 重 鉄 銀 開 院 陽 階 集 面 題 飲 館 駅 鼻",
  "7급":
    "不 争 井 付 令 以 仲 伝 位 低 佐 例 便 信 倉 候 借 健 側 働 億 兆 児 共 兵 典 冷 初 別 利 刷 副 功 加 努 労 勇 包 卒 協 単 博 印 参 司 各 周 唱 器 固 城 埼 塩 変 夫 失 奈 好 媛 季 孫 完 官 害 富 察 岐 岡 崎 巣 差 希 席 帯 底 府 康 建 径 徒 徳 必 念 愛 成 戦 折 挙 改 敗 散 料 旗 昨 景 最 望 未 末 札 材 束 松 果 栃 栄 案 梅 梨 械 極 標 機 欠 残 氏 民 求 沖 治 法 泣 浅 浴 清 満 滋 漁 潟 灯 無 然 焼 照 熊 熱 牧 特 産 的 省 祝 票 種 積 競 笑 管 節 約 結 給 続 縄 置 群 老 臣 良 芸 芽 英 茨 菜 街 衣 要 覚 観 訓 試 説 課 議 貨 賀 軍 輪 辞 辺 連 達 選 郡 量 録 鏡 関 阜 阪 陸 隊 静 順 願 類 飛 飯 養 香 験 鹿",
  "6급":
    "久 仏 仮 件 任 似 余 価 保 修 個 停 備 像 再 刊 判 制 則 効 務 勢 厚 句 可 史 告 喜 営 因 団 囲 圧 在 均 型 基 堂 報 境 墓 増 士 夢 妻 婦 容 寄 導 居 属 布 師 常 幹 序 弁 張 往 得 復 志 応 快 性 情 態 慣 技 招 授 採 接 提 損 支 政 故 救 断 旧 易 暴 条 枝 査 格 桜 検 構 武 歴 殺 毒 比 永 河 液 混 減 測 準 演 潔 災 燃 版 犯 状 独 率 現 留 略 益 眼 破 確 示 祖 禁 移 程 税 築 粉 精 紀 素 経 統 絶 綿 総 編 績 織 罪 義 耕 職 肥 能 脈 興 舎 航 術 衛 製 複 規 解 設 許 証 評 講 謝 識 護 豊 象 財 貧 責 貯 貸 費 貿 資 賛 賞 質 輸 述 迷 逆 造 過 適 酸 鉱 銅 防 限 険 際 雑 非 領 額 飼",
  "5급":
    "並 乱 乳 亡 仁 供 俳 俵 値 傷 優 党 冊 処 券 刻 割 創 劇 勤 危 卵 厳 収 后 否 吸 呼 善 困 垂 域 奏 奮 姿 存 孝 宅 宇 宗 宙 宝 宣 密 寸 専 射 将 尊 就 尺 届 展 層 己 巻 幕 干 幼 庁 座 延 律 従 忘 忠 恩 憲 我 批 承 担 拝 拡 捨 探 推 揮 操 敬 敵 映 晩 暖 暮 朗 机 枚 染 株 棒 模 権 樹 欲 段 沿 泉 洗 派 済 源 潮 激 灰 熟 片 班 異 疑 痛 皇 盛 盟 看 砂 磁 私 秘 穀 穴 窓 筋 策 簡 糖 系 紅 納 純 絹 縦 縮 署 翌 聖 肺 胃 背 胸 脳 腸 腹 臓 臨 至 舌 若 著 蒸 蔵 蚕 衆 裁 装 裏 補 視 覧 討 訪 訳 詞 誌 認 誕 誠 誤 論 諸 警 貴 賃 退 遺 郵 郷 針 銭 鋼 閉 閣 降 陛 除 障 難 革 頂 預 骨",
  "4급":
    "丈 与 丘 丹 乾 互 介 仰 伺 依 侵 俗 倒 偉 傍 傾 僧 儀 兼 冒 凡 凶 刈 到 刺 剣 剤 劣 勧 匹 占 即 却 及 叫 召 吐 含 吹 咲 唐 嘆 噴 圏 坊 執 堅 堤 塔 壁 壊 壱 奇 奥 奴 妙 姓 威 娘 婚 寂 寝 尋 尽 尾 屈 峠 峰 巡 巨 帽 幅 幾 床 弐 弾 彩 影 彼 征 御 微 徴 忙 怒 怖 恋 恐 恒 恥 恵 悩 惑 惨 慎 慢 慮 憶 戒 戯 扇 払 扱 抗 抜 抱 抵 押 拍 拓 拠 振 捕 掘 描 握 援 搬 摘 撃 攻 敏 敷 斜 旨 旬 是 普 暇 暦 曇 更 替 朱 朽 杯 枯 柄 柔 桃 欄 歓 歳 殖 殿 汗 汚 沈 沢 沼 況 泊 浜 浮 浸 涙 淡 添 渡 溶 滴 漫 澄 濁 濃 為 烈 煙 煮 燥 爆 狂 狩 狭 猛 獣 獲 玄 珍 環 甘 畳 疲 療 皆 盆 盗 監 盤 盾 眠 瞬 矛 砲 祈 秀 称 稲 稿 突 端 箇 範 粒 紋 紫 紹 絡 継 維 網 緯 縁 繁 繰 罰 翼 耐 肩 肪 胴 脂 脚 脱 腐 腕 腰 膚 致 舗 舞 舟 般 芋 芝 茂 荒 菓 蓄 薄 薪 被 襲 触 訴 詰 詳 誇 誉 謡 豪 販 賦 贈 越 趣 距 跡 跳 踊 踏 躍 軒 較 載 輝 輩 込 迎 迫 逃 透 途 遅 違 遣 避 郎 釈 鈍 鉛 鋭 鎖 鑑 闘 陣 陰 隠 隣 隷 雄 雅 雌 離 雷 需 震 霧 露 響 項 頼 飾 駆 騒 驚 髪 鬼 鮮 麗 黙 鼓 齢",
  "3급":
    "乏 乙 了 企 伏 伐 伴 伸 佳 侍 促 倣 倹 偶 催 債 克 免 冗 冠 凍 凝 刑 削 励 勘 募 匠 匿 卑 卓 卸 厘 又 双 吉 吏 哀 哲 啓 喚 喫 嘱 坑 埋 塊 塗 墜 墨 墳 墾 壇 奉 契 奪 如 妨 姫 娯 婆 婿 嫁 嬢 孔 孤 宴 審 寿 封 尿 岳 峡 崩 巧 帆 帝 幻 幽 廉 廊 弧 彫 徐 忌 怠 怪 恨 悔 悟 悦 惜 愚 慈 慌 慕 慨 慰 憂 憎 憩 房 抑 択 抽 拘 掃 掌 排 掛 控 措 掲 揚 換 揺 携 搾 摂 撮 擁 擦 敢 斗 斤 斥 施 既 昇 晶 暫 架 某 桑 棄 棋 楼 概 欧 欺 殊 殴 没 泌 浪 湾 湿 滅 滑 滝 滞 漂 漏 潜 潤 濫 瀬 炉 炊 炎 焦 牲 犠 猟 獄 甲 畔 畜 疾 痘 癖 硬 碑 礎 祉 稚 穂 穏 穫 窒 符 篤 簿 籍 粋 粗 粘 糧 紛 紺 絞 綱 緊 締 緩 縛 縫 繕 翻 聴 肝 胆 胎 胞 脅 膜 膨 芳 苗 菊 華 葬 藩 虐 虚 蛮 衝 衰 袋 裂 裸 覆 訂 託 詠 該 誘 請 諮 諾 謀 譲 豚 貫 賊 賢 赦 赴 超 軌 軸 辛 辱 逮 遂 遇 遭 遵 邦 邪 郊 郭 酔 酵 鋳 錠 錬 錯 鍛 鎮 鐘 閲 阻 陪 陳 陵 陶 隆 随 隔 隻 雇 零 霊 顧 飽 餓 駐 騎 髄 魂 魅 魔 鯨 鶏",
  준2급:
    "且 丙 亜 享 亭 仙 伯 但 併 侮 侯 俊 俸 倫 偏 偵 偽 傑 傘 僕 僚 儒 償 充 准 凸 凹 刃 剖 剛 剰 劾 勅 勲 升 厄 叔 叙 吟 呈 呉 唆 唇 唯 喝 喪 嗣 嚇 囚 坪 垣 培 堀 堕 堪 塀 塁 塑 塚 塾 壌 壮 奔 奨 妃 妄 妊 妥 姻 娠 媒 嫌 嫡 宜 宰 宵 寛 寡 寧 寮 尉 尚 尼 履 屯 岬 崇 帥 幣 庶 庸 廃 廷 弊 弔 弦 彰 循 徹 忍 恭 悠 患 悼 惰 愁 愉 慶 憤 憾 懇 懐 懲 懸 戻 扉 扶 抄 把 披 抹 拐 拒 拙 括 拷 挑 挟 挿 捜 据 搭 摩 撤 撲 擬 斉 斎 旋 昆 暁 曹 朕 朴 杉 析 枠 枢 柳 栓 核 栽 桟 棚 棟 棺 槽 款 殉 殻 汁 江 沸 泡 泥 泰 洞 津 洪 浄 浦 涯 涼 淑 渇 渉 渋 渓 渦 溝 漆 漠 漬 漸 濯 煩 爵 猫 献 猶 猿 珠 琴 璽 瓶 甚 畝 疎 疫 症 痢 痴 癒 盲 眺 睡 督 矯 砕 硝 硫 碁 磨 礁 祥 禅 禍 租 秩 稼 窃 窮 窯 竜 筒 粛 粧 糾 紡 索 累 紳 緒 繊 繭 缶 罷 羅 翁 耗 肌 肖 肢 肯 臭 舶 艇 艦 茎 荘 菌 薦 薫 藻 虜 虞 蚊 蛇 蛍 融 衡 衷 裕 褐 褒 襟 覇 訟 診 詐 詔 誓 諭 謁 謄 謙 謹 譜 貞 貢 賄 賓 賜 賠 購 践 軟 轄 迅 迭 逐 逓 逝 逸 遍 遮 遷 還 邸 酌 酢 酪 酬 酷 醜 醸 釣 鈴 鉢 銃 銘 閑 閥 附 陥 隅 雰 霜 靴 韻 頑 頒 頻 顕 飢 駄 騰 麻",
  "2급":
    "串 丼 乞 亀 伎 侶 俺 傲 僅 冥 冶 凄 刹 剥 勃 勾 匂 叱 呂 呪 咽 哺 唄 唾 喉 喩 嗅 嘲 堆 塞 填 妖 妬 嫉 宛 尻 崖 嵐 巾 弄 弥 彙 怨 恣 惧 慄 憧 憬 戚 戴 拉 拭 拳 拶 挨 挫 捉 捗 捻 摯 斑 斬 旦 旺 昧 曖 曽 枕 柵 柿 桁 梗 椅 椎 楷 毀 氾 汎 汰 沃 沙 淫 湧 溺 潰 煎 爪 爽 牙 狙 玩 瑠 璃 璧 瓦 畏 畿 痕 痩 瘍 眉 睦 瞭 瞳 稽 窟 箋 箸 籠 綻 緻 罵 羞 羨 肘 股 脇 脊 腎 腫 腺 膝 膳 臆 臼 舷 艶 芯 苛 萎 葛 蓋 蔑 蔽 藍 藤 虎 虹 蜂 蜜 袖 裾 訃 詣 詮 誰 諦 諧 謎 貌 貪 貼 賂 賭 踪 蹴 辣 遜 遡 那 酎 醒 采 釜 錦 錮 鍋 鍵 鎌 闇 隙 韓 頃 須 頓 頬 顎 餅 餌 駒 骸 鬱 鶴 麓 麺",
  준1급:
    "丑 丞 乃 之 乍 乎 也 云 亘 亙 些 亥 亦 亨 亮 什 仇 仔 伊 伍 伶 伽 佃 佑 佼 侃 侠 俄 俣 倖 倦 倭 倶 偲 傭 僑 僻 儘 儲 允 兇 兔 兜 其 冴 凋 凌 凧 凪 凰 凱 函 剃 劃 劉 劫 勿 匙 匝 匡 匪 卜 卦 卯 卿 厭 叉 叛 叡 叢 叩 只 叶 吃 吊 吋 吠 吻 吾 呆 呑 咳 哉 哨 哩 唖 啄 喋 喧 喬 喰 嘉 嘗 嘘 嘩 噂 噌 噛 噸 噺 嚢 圃 圭 坐 坤 坦 垢 埜 埠 埴 堰 堵 堺 塘 塙 塵 壕 壬 壺 夙 夷 奄 套 妓 妾 姐 姑 姥 姦 姪 姶 娃 娩 娼 婁 嬉 嬬 嬰 孜 孟 宋 宍 宏 宕 宥 寅 寓 寵 尖 尤 尭 屍 屑 屡 岨 岱 峨 峯 峻 嵩 嵯 嶋 嶺 巌 巳 巴 巷 巽 帖 幌 幡 庄 庇 庖 庚 庵 廏 廓 廚 廟 廠 廻 廿 弗 弘 弛 弼 彊 彦 彪 彬 徽 忽 怜 怯 恕 恢 恰 悉 悌 悶 惇 惚 惟 惣 惹 愈 慧 慾 憐 戊 戎 或 戟 托 扮 按 挺 挽 捌 捧 捲 捷 捺 掠 掩 掬 掴 掻 揃 揖 摸 摺 撒 撚 撞 撫 播 撰 擢 擾 攪 敦 斌 斐 斡 斧 斯 於 旭 昂 昌 昏 晃 晋 晒 晦 智 暢 曙 曝 曳 朋 朔 李 杏 杓 杖 杜 杢 杭 杵 杷 枇 柁 柊 柏 柑 柘 柚 柴 柾 栂 栖 栗 栴 桂 桐 桓 桔 桝 桶 梁 梓 梢 梧 梯 梱 梶 棉 棲 椀 椋 椙 椛 椴 椿 楊 楓 楚 楠 楢 楯 楳 榊 榎 榛 槌 槍 槙 槻 樋 樗 樟 樫 樵 樺 樽 橘 橡 橢 橿 檀 檎 檜 檮 櫓 櫛 欣 欽 歎 此 歪 殆 毅 毘 汀 汐 汝 汲 沌 沓 沫 洛 洩 洲 浩 浬 涌 涜 淀 淋 淘 淳 淵 渚 渠 渥 湊 湘 湛 溌 溜 溢 溯 漉 漑 漕 漣 澗 澱 濠 濡 濤 瀕 瀞 瀦 瀧 灌 灘 灸 灼 烏 烹 焔 焚 煉 煤 煽 燈 燐 燕 燦 燭 爺 爾 牌 牒 牝 牟 牡 牢 牽 犀 狐 狗 狛 狸 狼 狽 猪 猷 獅 玖 玲 珂 珊 珪 琉 琢 琳 琵 琶 瑚 瑛 瑞 瑳 瓜 瓢 甑 甜 甥 甫 畠 畢 畦 畷 疋 疏 疹 痔 癌 皐 盃 盈 瞥 矧 矩 砥 砦 砧 硯 硲 碇 碍 碓 碧 碩 磐 磯 礦 礪 祁 祇 祐 祷 禄 禎 禦 禰 禽 禾 禿 秤 秦 稀 稔 稗 稜 穆 穎 穣 穿 窄 窪 窺 竈 竣 竺 竿 笈 笠 笥 笹 筈 筏 筑 箔 箕 箪 箭 篇 篠 篦 簸 簾 籾 粁 粂 粍 粕 粟 粥 糊 糎 糞 糟 糠 紐 紗 紘 紬 絃 絢 綜 綬 綴 綾 緋 緬 縞 繋 繍 纂 纏 罫 翠 翫 翰 耀 而 耶 耽 聡 聯 聾 肇 肋 肱 肴 胡 胤 脆 腔 腿 膏 膿 臥 舘 舛 舜 舵 艮 芙 芥 芭 芹 苅 苑 苒 苓 苔 苧 苫 茄 茅 茜 茸 荊 荏 荻 莞 莫 莱 菅 菖 菟 菩 菰 菱 萄 萌 萩 萱 葎 葡 董 葦 葱 葵 葺 蒋 蒐 蒔 蒙 蒜 蒲 蒼 蓉 蓑 蓬 蓮 蔀 蔓 蔚 蔦 蔭 蕃 蕉 蕊 蕎 蕗 蕨 蕩 蕪 薗 薙 薩 薯 藁 藪 藷 蘇 蘭 虻 蚤 蛋 蛙 蛛 蛤 蛭 蛸 蛾 蜘 蝉 蝋 蝕 蝦 蝶 螺 蟹 蟻 蠅 蠣 衿 袈 袴 袷 裟 裡 裳 襖 覗 訊 訣 註 詑 詫 誹 誼 諏 諒 諜 諫 諺 謂 謬 讚 豎 豹 貰 賑 賤 贋 赫 趨 跨 蹄 蹟 躯 輔 輯 輿 轍 轟 轡 辰 辻 辿 迂 迄 迦 迺 逗 這 逢 逼 遁 遥 遼 邇 邑 郁 鄭 酉 酋 醇 醍 醐 醗 醤 釘 釦 釧 鈷 鉤 鉦 鉾 銚 鋒 鋤 鋪 鋲 鋸 錆 錐 錨 錫 鍍 鍔 鍬 鍾 鎔 鎗 鎚 鎧 鏑 鐙 鐸 鑓 閃 閏 閤 阿 陀 隈 隼 雀 雁 雛 雫 霞 靖 靭 鞄 鞍 鞘 鞠 鞭 韃 韭 頁 頗 頸 顛 飴 餐 餠 饗 馨 馳 馴 駁 駈 駕 駿 騨 髭 魁 魯 鮎 鮒 鮪 鮫 鮭 鯉 鯖 鯛 鰍 鰐 鰭 鰯 鰹 鰺 鰻 鱈 鱒 鱗 鳩 鳳 鳶 鴇 鴎 鴛 鴦 鴨 鴫 鴻 鵜 鵠 鵡 鵬 鶯 鷲 鷹 鷺 鸚 鹸 麒 麟 麹 麿 黍 黛 鼎 鼠 龍 龝",
  "1급":
    "丐 丕 丗 个 丱 丶 丿 乂 乕 乖 乘 乢 亂 亅 亊 于 亞 亟 亠 亢 亰 亳 亶 仂 仄 仆 仍 从 仗 仞 仟 仭 价 伉 伜 估 佇 佗 佚 佛 佝 佞 佩 佯 佰 佶 佻 來 侈 侏 侑 侖 侘 侫 侭 俎 俐 俑 俔 俘 俚 俛 俟 俤 俥 俯 俶 俾 倅 倆 倏 們 倔 倚 倡 倥 倨 倩 倪 倬 偃 假 偈 偐 偕 偖 做 偬 偸 傀 傅 傚 傳 傴 僂 僉 僊 僖 僞 僣 僥 僭 僮 僵 價 儁 儂 儉 儔 儕 儖 儚 儡 儷 儺 儻 儼 儿 兀 兌 兎 兒 兢 兩 兪 兮 冀 冂 冉 册 冏 冐 冑 冓 冕 冖 冢 冤 冦 冨 冩 冪 冫 冰 冱 冲 决 况 冽 凅 凉 凖 凛 凜 几 凩 凭 凵 凾 刄 刋 刎 刔 刧 刪 刮 刳 剄 剋 剌 剏 剔 剞 剩 剪 剱 剳 剴 剽 剿 劈 劍 劑 劒 劔 劬 劭 劵 劼 勁 勍 勒 勗 勞 勠 勣 勦 勳 勵 勸 勹 匆 匈 匍 匏 匐 匕 匚 匣 匯 匱 匳 匸 區 卅 卆 卉 卍 卞 卩 卮 卷 卻 厂 厖 厠 厥 厦 厨 厩 厮 厰 厶 參 叟 叨 叭 叮 叺 吁 吝 吩 听 吭 吮 吶 吼 吽 呀 呎 呟 呰 呱 呵 呶 呷 呻 咀 咄 咆 咋 咎 咏 咐 咒 咢 咤 咥 咨 咫 咬 咯 咸 咼 咾 哂 哄 哇 哈 哘 哢 哥 哦 哭 哮 哽 唏 唔 售 唳 唸 唹 啀 啅 啌 啖 啗 啜 啝 啣 啻 啼 啾 喀 喃 喇 喊 喘 喙 喞 喟 喨 單 嗄 嗇 嗔 嗚 嗜 嗟 嗤 嗷 嗹 嗽 嗾 嘔 嘖 嘛 嘯 嘴 嘶 嘸 噎 噐 噤 噪 噫 噬 嚀 嚆 嚊 嚏 嚔 嚠 嚥 嚮 嚴 嚶 嚼 囀 囁 囂 囃 囈 囎 囑 囓 囗 囘 囮 囹 囿 圀 圄 圈 圉 國 圍 圓 圖 團 圜 圦 圷 圸 圻 址 坎 坏 坡 坩 坿 垈 垉 垓 垠 垤 垪 垰 垳 埀 埃 埆 埒 埓 埔 埖 埣 堊 堋 堙 堝 堡 堯 堽 塋 塒 塢 塰 塲 塹 墅 墟 墫 墮 墸 墹 墺 墻 壅 壑 壓 壗 壘 壙 壜 壞 壟 壤 壥 壯 壷 壹 壻 壼 壽 夂 夊 夐 夘 夛 夥 夬 夭 夲 夸 夾 奎 奐 奕 奘 奚 奠 奢 奧 奩 奬 奸 妁 妍 妛 妝 妣 妲 姆 姙 姚 姜 姨 娉 娑 娚 娜 娟 娥 娵 娶 婀 婉 婢 婪 婬 媚 媼 媽 媾 嫂 嫋 嫐 嫖 嫗 嫣 嫦 嫩 嫺 嫻 嬋 嬌 嬖 嬪 嬲 嬶 嬾 孀 孃 孅 孑 孕 孚 孛 孥 孩 孰 孱 孳 孵 學 孺 宀 它 宦 宸 寃 寇 寉 寐 寔 寞 寢 寤 寥 實 寨 寫 寰 寳 寶 尅 將 專 對 尓 尠 尢 尨 尸 尹 屁 屆 屎 屏 屐 屓 屠 屬 屮 屶 屹 岌 岑 岔 岫 岶 岷 岻 岼 岾 峅 峇 峙 峩 峪 峭 峺 峽 崋 崑 崔 崕 崗 崘 崙 崚 崛 崟 崢 嵋 嵌 嵎 嵒 嵜 嵬 嵳 嵶 嶂 嶄 嶇 嶌 嶐 嶝 嶢 嶬 嶮 嶷 嶼 嶽 巉 巍 巒 巓 巖 巛 巫 已 巵 帋 帑 帙 帚 帛 帶 帷 幀 幃 幄 幇 幎 幔 幗 幟 幢 幤 幵 并 幺 广 庠 廁 廂 廈 廐 廖 廛 廝 廡 廢 廣 廨 廩 廬 廰 廱 廳 廴 廸 廼 廾 弃 弉 弋 弌 弍 弑 弖 弩 弭 弯 弸 彁 彈 彌 彎 彑 彖 彗 彜 彝 彡 彭 彳 彷 彿 徂 徃 徇 很 徊 徑 徘 徙 從 徠 徨 徭 徼 忖 忝 忤 忰 忱 忸 忻 忿 怎 怏 怐 怕 怙 怛 怡 怦 怩 怫 怱 怺 恁 恂 恃 恆 恊 恍 恙 恚 恟 恠 恤 恪 恫 恬 恷 悁 悃 悄 悋 悍 悒 悖 悗 悚 悛 悧 悳 悴 悵 悸 悽 惆 惓 惘 惠 惡 惱 惴 惶 惷 惺 惻 愀 愃 愆 愍 愎 愕 愡 愧 愨 愬 愴 愼 愽 愾 愿 慂 慇 慊 慍 慓 慘 慙 慚 慝 慟 慥 慫 慯 慱 慳 慴 慵 慷 憇 憊 憑 憔 憖 憙 憚 憫 憮 憺 懃 懆 懈 應 懊 懋 懌 懍 懣 懦 懴 懶 懷 懺 懼 懽 懾 懿 戀 戈 戉 戌 戍 戔 戛 戝 戞 戡 截 戮 戰 戲 戳 扁 扈 扎 扛 扞 扠 扣 扨 扼 找 抂 抃 抉 抒 抓 抔 抖 抛 抬 抻 拂 拆 拇 拈 拊 拌 拏 拑 拔 拗 拜 拮 拯 拱 拵 拿 挂 挈 挌 挧 挾 捍 捏 捐 捩 捫 捶 掀 掉 掎 掏 掖 掟 掣 掫 掵 掾 揀 揄 揆 揉 插 揣 揩 揶 搆 搏 搓 搖 搗 搜 搦 搨 搴 搶 摎 摧 摶 撈 撓 撕 撥 撩 撹 撻 撼 擂 擅 擇 擒 擔 擘 據 擠 擡 擣 擧 擯 擱 擲 擴 擶 擺 擽 攀 攅 攘 攜 攝 攣 攤 攫 攬 攴 攵 收 攷 攸 效 敍 敕 敖 敘 敝 敞 敲 數 斂 斃 斈 斛 斟 斫 斷 旁 旃 旄 旆 旌 旒 旙 旛 无 旡 旱 旻 昃 昊 昜 昴 昵 昶 昿 晁 晄 晉 晏 晝 晞 晟 晢 晤 晧 晨 晰 暃 暄 暈 暉 暎 暘 暝 暸 暹 暼 暾 曁 曄 曉 曚 曠 曦 曩 曰 曵 曷 曼 曾 會 朏 朖 朞 朦 朧 朮 朶 朷 朸 朿 杁 杆 杙 杞 杠 杣 杤 杪 杰 杲 杳 杼 枅 枉 枋 枌 枡 枦 枩 枳 枴 枷 枸 枹 柆 柎 柝 柞 柢 柤 柧 柩 柬 柮 柯 栞 栢 栩 栫 栲 桀 框 桍 桎 桙 档 桧 桴 桷 桾 桿 梃 梍 梏 梔 梛 條 梟 梠 梦 梭 梳 梵 梹 梺 梼 棆 棊 棍 棔 棕 棗 棘 棠 棡 棣 棧 棯 棹 椁 椄 椈 椌 椏 椒 椚 椡 椢 椣 椥 椦 椨 椪 椰 椶 椹 椽 楔 楕 楙 楜 楝 楞 楡 楪 楫 楮 楴 楸 楹 楾 榁 榑 榔 榕 榜 榠 榧 榮 榱 榲 榴 榻 榾 榿 槁 槃 槇 槊 槎 槐 槓 槝 槞 槧 槨 槫 槭 槲 槹 槿 樂 樅 樊 樌 樒 樓 樔 樛 樞 樢 樣 樮 樶 樸 橄 橇 橈 橙 橦 橲 橸 檄 檍 檐 檗 檠 檢 檣 檪 檬 檳 檸 檻 櫁 櫂 櫃 櫑 櫚 櫞 櫟 櫨 櫪 櫺 櫻 欅 權 欒 欖 欝 欟 欷 欸 欹 歃 歇 歉 歐 歔 歙 歛 歟 歡 歸 歹 歿 殀 殃 殄 殍 殕 殘 殞 殤 殪 殫 殯 殱 殲 殳 殷 殼 毆 毋 毓 毟 毫 毬 毯 毳 氈 氓 气 氛 氣 氤 汕 汞 汢 汨 汪 汳 汾 沁 沂 沍 沐 沒 沚 沛 沮 沱 沺 沽 沾 泄 泅 泓 泗 泙 泛 泝 泪 泯 泱 洌 洒 洙 洟 洫 洳 洵 洶 洸 洽 浙 浚 浣 浤 浹 涅 涎 涓 涕 涛 涵 涸 淅 淆 淇 淌 淒 淕 淙 淞 淤 淦 淨 淪 淬 淮 淹 淺 渊 渕 渙 渝 渟 渣 渤 渫 渭 渮 游 渺 渾 湃 湍 湎 湟 湫 湮 湲 湶 溂 溏 溘 溟 溥 溪 溲 溷 溽 滂 滄 滉 滌 滓 滔 滕 滬 滯 滲 滷 滸 滾 滿 漓 漱 漲 漾 漿 潁 潅 潘 潛 潦 潭 潯 潴 潸 潺 潼 澀 澁 澂 澆 澎 澑 澡 澣 澤 澪 澳 澹 濂 濆 濔 濕 濘 濛 濟 濬 濮 濱 濳 濶 濺 濾 瀁 瀉 瀋 瀏 瀑 瀘 瀚 瀛 瀝 瀟 瀰 瀲 瀾 灑 灣 炒 炙 炬 炮 炯 炳 炸 烋 烙 烝 烟 烱 烽 焉 焙 焜 煌 煕 煖 煢 煥 煦 煬 熄 熈 熏 熔 熕 熙 熨 熬 熹 熾 燉 燎 燒 燔 燗 營 燠 燧 燬 燮 燵 燹 燻 燼 燿 爍 爐 爛 爨 爬 爭 爰 爲 爻 爼 爿 牀 牆 牋 牘 牴 牾 犁 犂 犇 犒 犖 犢 犧 犲 犹 狃 狄 狆 狎 狒 狠 狡 狢 狷 狹 猊 猖 猗 猜 猝 猥 猩 猯 猴 猾 獎 獏 獗 獨 獪 獰 獵 獸 獺 獻 玳 玻 珀 珈 珎 珞 珥 珮 珱 珸 琅 琥 琲 琺 琿 瑁 瑕 瑙 瑜 瑟 瑣 瑤 瑩 瑪 瑯 瑰 瑶 瑾 璋 璞 璢 瓊 瓏 瓔 瓠 瓣 瓧 瓩 瓮 瓰 瓱 瓲 瓷 瓸 甃 甄 甅 甌 甍 甎 甓 甕 甞 甦 甬 甸 甼 畄 畆 畉 畊 畋 畍 畚 畛 畤 畧 畩 畫 畭 畴 當 畸 疂 疆 疇 疉 疊 疔 疚 疝 疣 疥 疱 疳 疵 疸 疼 疽 痂 痃 痊 痍 痒 痙 痞 痣 痰 痲 痳 痺 痼 痾 痿 瘁 瘉 瘋 瘟 瘠 瘡 瘢 瘤 瘧 瘰 瘴 瘻 癆 癇 癈 癘 癜 癡 癢 癧 癨 癩 癪 癬 癰 癲 癶 癸 發 皀 皃 皈 皋 皎 皓 皖 皙 皚 皰 皴 皷 皸 皹 皺 盂 盍 盒 盖 盜 盞 盡 盥 盧 盪 盻 眄 眇 眈 眛 眞 眤 眥 眦 眩 眷 眸 睇 睚 睛 睥 睨 睫 睹 睾 睿 瞋 瞎 瞑 瞞 瞠 瞰 瞶 瞹 瞻 瞼 瞽 瞿 矇 矍 矗 矚 矜 矣 矮 矼 砌 砒 砠 砺 砿 硅 硴 硼 碆 碌 碎 碕 碗 碚 碣 碪 碯 碵 碼 碾 磅 磆 磊 磋 磑 磔 磚 磧 磬 磴 磽 礇 礑 礒 礙 礫 礬 祀 祓 祕 祗 祚 祟 祠 祢 祺 祿 禀 禊 禝 禧 禪 禮 禳 禹 禺 秉 秕 秡 秣 秧 秬 稈 稍 稘 稙 稟 稠 稱 稷 稻 稾 穃 穉 穐 穗 穡 穢 穩 穰 穹 穽 窈 窕 窖 窗 窘 窩 窰 窶 窿 竃 竄 竅 竇 竊 竍 竏 竒 竓 竕 站 竚 竝 竟 竡 竢 竦 竪 竭 竰 竸 笂 笄 笆 笊 笋 笏 笘 笙 笞 笨 笳 笵 笶 筅 筌 筍 筐 筝 筥 筧 筬 筮 筰 筱 筴 筵 筺 箆 箍 箏 箒 箘 箙 箚 箜 箝 箟 箴 篁 篆 篋 篌 篏 篝 篥 篩 篭 篳 篶 篷 簀 簇 簍 簑 簒 簓 簔 簗 簟 簣 簧 簪 簫 簷 簽 籀 籃 籌 籏 籐 籔 籖 籘 籟 籤 籥 籬 籵 粃 粐 粡 粢 粤 粨 粫 粭 粮 粱 粲 粳 粹 粽 糀 糂 糅 糒 糘 糜 糢 糯 糲 糴 糶 糺 紂 紆 紊 紕 紜 紮 紲 紵 紿 絅 絆 絋 絎 絏 絖 絛 絣 絨 絮 絲 絳 絽 綉 綏 經 綛 綟 綢 綣 綫 綮 綯 綰 綵 綸 綺 綽 緇 緕 緘 緜 緝 緞 緡 緤 緲 縅 縉 縊 縋 縒 縟 縡 縢 縣 縱 縲 縵 縷 縹 縺 縻 總 繃 繆 繖 繙 繚 繝 繞 繦 繧 繩 繪 繹 繻 繼 繽 繿 纃 纈 纉 續 纎 纐 纒 纓 纔 纖 纛 纜 缸 缺 罅 罌 罍 罎 罐 网 罔 罕 罘 罟 罠 罧 罨 罩 罸 罹 羂 羃 羆 羇 羈 羌 羔 羚 羝 羣 羮 羯 羲 羶 羸 羹 翅 翆 翊 翔 翕 翡 翦 翩 翳 翹 耄 耆 耋 耒 耘 耙 耜 耡 耨 耻 耿 聆 聊 聒 聘 聚 聟 聢 聨 聰 聲 聳 聶 聹 聽 聿 肄 肅 肆 肓 肚 肛 肬 肭 胄 胖 胙 胚 胛 胝 胥 胯 胱 胼 脉 脛 脣 脩 脯 脾 腆 腋 腑 腓 腟 腥 腦 腮 腱 腴 膀 膂 膃 膈 膊 膓 膕 膠 膣 膤 膩 膰 膵 膸 膺 膽 膾 臀 臂 臈 臉 臍 臑 臘 臙 臚 臟 臠 臧 臺 臻 臾 舁 舂 舅 與 舉 舊 舍 舐 舒 舖 舩 舫 舮 舳 舸 艀 艘 艙 艚 艝 艟 艢 艤 艨 艪 艫 艱 艷 艸 艾 芍 芒 芟 芦 芫 芬 芻 苙 苜 苞 苟 苡 苣 苳 苴 苹 苺 苻 范 茆 茉 茖 茗 茘 茣 茫 茯 茱 茲 茴 茵 茹 荀 荅 荐 荳 荵 荼 莅 莇 莉 莊 莎 莓 莖 莚 莟 莠 莢 莨 莪 莵 莽 菁 菎 菘 菠 菫 菲 菴 菷 菻 菽 萃 萇 萋 萍 萓 萠 萢 萪 萬 萵 萸 萼 葆 葢 葩 葫 葭 葮 葯 葷 葹 蒂 蒄 蒟 蒡 蒭 蒹 蒻 蒿 蓁 蓆 蓊 蓍 蓐 蓖 蓙 蓚 蓴 蓼 蓿 蔆 蔔 蔕 蔗 蔘 蔟 蔡 蔬 蕀 蕁 蕈 蕋 蕕 蕘 蕚 蕣 蕭 蕷 蕾 薀 薇 薈 薊 薐 薑 薔 薛 薜 薤 薨 薮 薹 薺 藉 藏 藐 藕 藜 藝 藥 藹 藺 藾 蘂 蘆 蘊 蘋 蘓 蘖 蘗 蘚 蘢 蘯 蘰 蘿 虍 虔 處 號 虧 虱 蚋 蚌 蚓 蚣 蚩 蚪 蚫 蚯 蚰 蚶 蛄 蛆 蛉 蛎 蛔 蛞 蛟 蛩 蛬 蛯 蛹 蛻 蜀 蜃 蜆 蜈 蜉 蜊 蜍 蜑 蜒 蜚 蜥 蜩 蜴 蜷 蜻 蜿 蝌 蝎 蝓 蝗 蝙 蝟 蝠 蝣 蝨 蝪 蝮 蝴 蝸 蝿 螂 螟 螢 螫 螯 螳 螻 螽 蟀 蟄 蟆 蟇 蟋 蟐 蟒 蟠 蟯 蟲 蟶 蟷 蟾 蠍 蠎 蠏 蠑 蠕 蠖 蠡 蠢 蠧 蠱 蠶 蠹 蠻 衂 衄 衍 衒 衙 衞 衢 衫 衲 衵 衽 衾 袁 袂 袍 袒 袗 袙 袞 袢 袤 袮 袰 袱 袵 袿 裃 裄 裔 裘 裙 裝 裨 裲 裴 裹 裼 褂 褄 褊 褌 褓 褝 褞 褥 褪 褫 褶 褸 褻 襁 襃 襄 襌 襍 襞 襠 襤 襦 襪 襭 襯 襴 襷 襾 覃 覈 覊 覓 覘 覡 覦 覩 覬 覯 覲 覺 覽 覿 觀 觚 觜 觝 觧 觴 觸 訌 訐 訖 訛 訝 訥 訶 詁 詆 詈 詒 詛 詢 詬 詭 詼 誂 誄 誅 誑 誚 誡 誣 誥 誦 誨 諂 諄 諌 諍 諚 諛 諞 諠 諡 諢 諤 諱 諳 諷 謇 謌 謐 謔 謖 謗 謚 謠 謦 謨 謫 謳 謾 譁 證 譌 譎 譏 譖 譚 譛 譟 譫 譬 譯 譱 譴 譽 讀 讃 變 讌 讎 讐 讒 讓 讖 讙 谺 谿 豁 豈 豌 豐 豕 豢 豫 豬 豸 豺 豼 貂 貅 貉 貊 貍 貎 貔 貘 貭 貮 貲 貳 貶 貽 賁 賈 賍 賎 賚 賣 賺 賻 賽 贄 贅 贇 贊 贍 贏 贐 贓 贔 贖 赧 赭 赱 赳 趁 趙 趺 趾 跂 跋 跌 跏 跖 跚 跛 跟 跣 跪 跫 跼 跿 踈 踉 踐 踝 踞 踟 踰 踴 踵 蹂 蹇 蹈 蹉 蹊 蹌 蹐 蹕 蹙 蹠 蹣 蹤 蹲 蹶 蹼 躁 躄 躅 躇 躊 躋 躑 躓 躔 躙 躡 躪 躬 躰 躱 躾 軅 軆 軈 軋 軛 軣 軫 軻 軼 軾 輅 輊 輌 輒 輓 輕 輙 輛 輜 輟 輦 輳 輹 輻 輾 轂 轅 轆 轉 轌 轎 轗 轜 轢 轣 轤 辜 辟 辧 辨 辭 辮 辯 辷 迚 迢 迥 迩 迪 迯 迴 迸 迹 逅 逋 逍 逎 逑 逕 逖 逞 逡 逧 逵 逶 逹 逾 遉 遏 遐 遑 遒 遖 遘 遙 遞 遨 遯 遲 遶 遽 邀 邁 邂 邃 邉 邊 邏 邨 邯 邱 邵 郛 郢 郤 鄂 鄒 鄙 鄰 鄲 酊 酖 酘 酣 酥 酩 酲 酳 醂 醉 醋 醢 醪 醫 醯 醴 醵 醺 釀 釁 釆 釉 釋 釐 釖 釛 釟 釡 釵 釶 釼 釿 鈎 鈑 鈔 鈕 鈞 鈩 鈬 鈿 鉅 鉈 鉉 鉋 鉐 鉗 鉚 鉞 銓 銕 銖 銛 銜 銷 銹 鋏 鋩 鋺 錏 錙 錚 錢 錣 錵 錺 錻 鍄 鍖 鍜 鍠 鍮 鍼 鎬 鎭 鎰 鎹 鏃 鏈 鏐 鏖 鏗 鏘 鏝 鏤 鏥 鏨 鐃 鐇 鐐 鐓 鐔 鐚 鐡 鐫 鐵 鐶 鐺 鑁 鑄 鑒 鑚 鑛 鑞 鑠 鑢 鑪 鑰 鑵 鑷 鑼 鑽 鑾 鑿 钁 閂 閇 閊 閔 閖 閘 閙 閠 閧 閨 閭 閹 閻 閼 閾 闃 闊 闌 闍 闔 闕 闖 關 闡 闢 闥 阡 阨 阮 阯 陂 陋 陌 陏 陜 陝 陞 陟 陦 陬 陲 陷 隋 隍 隕 隗 隘 隧 隨 險 隰 隱 隲 隴 隶 隸 隹 雉 雋 雍 雎 雕 雖 雙 雜 雹 霄 霆 霈 霍 霎 霏 霑 霓 霖 霙 霤 霪 霰 霸 霹 霽 霾 靂 靄 靆 靈 靉 靜 靠 靡 靤 靦 靨 靫 靱 靹 靺 靼 鞁 鞅 鞆 鞋 鞏 鞐 鞜 鞣 鞦 鞨 鞫 鞳 鞴 韆 韈 韋 韜 韮 韲 韵 韶 頌 頏 頚 頡 頤 頴 頷 頽 顆 顋 顏 顫 顯 顰 顱 顳 顴 颪 颯 颱 颶 飃 飄 飆 飜 飩 飫 飭 飮 餃 餉 餒 餔 餘 餝 餞 餡 餤 餬 餮 餽 餾 饂 饅 饉 饋 饌 饐 饑 饒 饕 馗 馘 馥 馭 馮 馼 駑 駘 駛 駝 駟 駢 駭 駮 駱 駲 駸 駻 騁 騅 騏 騙 騫 騷 騾 驀 驂 驃 驅 驍 驕 驗 驛 驟 驢 驤 驥 驩 驪 驫 骭 骰 骼 髀 髏 髑 髓 體 髞 髟 髢 髣 髦 髫 髮 髯 髱 髴 髷 髻 鬆 鬘 鬚 鬟 鬢 鬣 鬥 鬧 鬨 鬩 鬪 鬮 鬯 鬲 鬻 魃 魄 魍 魎 魏 魑 魘 魴 鮃 鮑 鮓 鮖 鮗 鮟 鮠 鮨 鮴 鮹 鯀 鯆 鯊 鯏 鯑 鯒 鯔 鯡 鯢 鯣 鯤 鯰 鯱 鯲 鯵 鰄 鰆 鰈 鰉 鰊 鰌 鰒 鰓 鰔 鰕 鰛 鰡 鰤 鰥 鰮 鰰 鰲 鰾 鱆 鱇 鱚 鱠 鱧 鱶 鱸 鳧 鳫 鳬 鳰 鴃 鴆 鴈 鴉 鴒 鴕 鴟 鴣 鴪 鴬 鴾 鴿 鵁 鵄 鵆 鵈 鵐 鵑 鵙 鵝 鵞 鵤 鵯 鵲 鵺 鶇 鶉 鶚 鶤 鶩 鶫 鶲 鶸 鶺 鶻 鷁 鷂 鷄 鷆 鷏 鷓 鷙 鷦 鷭 鷯 鷸 鷽 鸛 鸞 鹵 鹹 鹽 麁 麈 麋 麌 麑 麕 麝 麥 麩 麪 麭 麸 麼 麾 黌 黎 黏 黐 黔 默 黜 黝 點 黠 黥 黨 黯 黴 黶 黷 黹 黻 黼 黽 鼇 鼈 鼕 鼡 鼬 鼾 齊 齋 齎 齏 齒 齔 齟 齠 齡 齣 齦 齧 齪 齬 齲 齶 齷 龕 龜 龠",
};

const GAKUNEN_KANJI_STRINGS = {
  "초등학교 1학년":
    "一 七 三 上 下 中 九 二 五 人 休 先 入 八 六 円 出 力 十 千 口 右 名 四 土 夕 大 天 女 子 字 学 小 山 川 左 年 手 文 日 早 月 木 本 村 林 校 森 正 気 水 火 犬 玉 王 生 田 男 町 白 百 目 石 空 立 竹 糸 耳 花 草 虫 見 貝 赤 足 車 金 雨 青 音",
  "초등학교 2학년":
    "万 丸 交 京 今 会 体 何 作 元 兄 光 公 内 冬 刀 分 切 前 北 午 半 南 原 友 古 台 合 同 回 図 国 園 地 場 声 売 夏 外 多 夜 太 妹 姉 室 家 寺 少 岩 工 市 帰 広 店 弓 引 弟 弱 強 当 形 後 心 思 戸 才 教 数 新 方 明 星 春 昼 時 晴 曜 書 朝 来 東 楽 歌 止 歩 母 毎 毛 池 汽 活 海 点 父 牛 理 用 画 番 直 矢 知 社 秋 科 答 算 米 紙 細 組 絵 線 羽 考 聞 肉 自 船 色 茶 行 西 親 角 言 計 記 話 語 読 谷 買 走 近 通 週 道 遠 里 野 長 門 間 雪 雲 電 頭 顔 風 食 首 馬 高 魚 鳥 鳴 麦 黄 黒",
  "초등학교 3학년":
    "丁 世 両 主 乗 予 事 仕 他 代 住 使 係 倍 全 具 写 列 助 勉 動 勝 化 区 医 去 反 取 受 号 向 君 味 命 和 品 員 商 問 坂 央 始 委 守 安 定 実 客 宮 宿 寒 対 局 屋 岸 島 州 帳 平 幸 度 庫 庭 式 役 待 急 息 悪 悲 想 意 感 所 打 投 拾 持 指 放 整 旅 族 昔 昭 暑 暗 曲 有 服 期 板 柱 根 植 業 様 横 橋 次 歯 死 氷 決 油 波 注 泳 洋 流 消 深 温 港 湖 湯 漢 炭 物 球 由 申 界 畑 病 発 登 皮 皿 相 県 真 着 短 研 礼 神 祭 福 秒 究 章 童 笛 第 筆 等 箱 級 終 緑 練 羊 美 習 者 育 苦 荷 落 葉 薬 血 表 詩 調 談 豆 負 起 路 身 転 軽 農 返 追 送 速 進 遊 運 部 都 配 酒 重 鉄 銀 開 院 陽 階 集 面 題 飲 館 駅 鼻",
  "초등학교 4학년":
    "不 争 付 令 以 仲 伝 位 低 例 便 信 倉 候 借 停 健 側 働 億 兆 児 共 兵 典 冷 初 別 利 刷 副 功 加 努 労 勇 包 卒 協 単 博 印 参 史 司 各 告 周 唱 喜 器 囲 固 型 堂 塩 士 変 夫 失 好 季 孫 完 官 害 察 巣 差 希 席 帯 底 府 康 建 径 徒 得 必 念 愛 成 戦 折 挙 改 救 敗 散 料 旗 昨 景 最 望 未 末 札 材 束 松 果 栄 案 梅 械 極 標 機 欠 歴 残 殺 毒 氏 民 求 治 法 泣 浅 浴 清 満 漁 灯 無 然 焼 照 熱 牧 特 産 的 省 祝 票 種 積 競 笑 管 節 粉 紀 約 結 給 続 置 老 胃 脈 腸 臣 航 良 芸 芽 英 菜 街 衣 要 覚 観 訓 試 説 課 議 象 貨 貯 費 賞 軍 輪 辞 辺 連 達 選 郡 量 録 鏡 関 陸 隊 静 順 願 類 飛 飯 養 験",
  "초등학교 5학년":
    "久 仏 仮 件 任 似 余 価 保 修 俵 個 備 像 再 刊 判 制 券 則 効 務 勢 厚 句 可 営 因 団 圧 在 均 基 報 境 墓 増 夢 妻 婦 容 寄 富 導 居 属 布 師 常 幹 序 弁 張 往 復 徳 志 応 快 性 恩 情 態 慣 承 技 招 授 採 接 提 損 支 政 故 敵 断 旧 易 暴 条 枝 査 格 桜 検 構 武 比 永 河 液 混 減 測 準 演 潔 災 燃 版 犯 状 独 率 現 留 略 益 眼 破 確 示 祖 禁 移 程 税 築 精 素 経 統 絶 綿 総 編 績 織 罪 群 義 耕 職 肥 能 興 舌 舎 術 衛 製 複 規 解 設 許 証 評 講 謝 識 護 豊 財 貧 責 貸 貿 賀 資 賛 質 輸 述 迷 退 逆 造 過 適 酸 鉱 銅 銭 防 限 険 際 雑 非 預 領 額 飼",
  "초등학교 6학년":
    "並 乱 乳 亡 仁 供 俳 値 傷 優 党 冊 処 刻 割 創 劇 勤 危 卵 厳 収 后 否 吸 呼 善 困 垂 城 域 奏 奮 姿 存 孝 宅 宇 宗 宙 宝 宣 密 寸 専 射 将 尊 就 尺 届 展 層 己 巻 幕 干 幼 庁 座 延 律 従 忘 忠 憲 我 批 担 拝 拡 捨 探 推 揮 操 敬 映 晩 暖 暮 朗 机 枚 染 株 棒 模 権 樹 欲 段 沿 泉 洗 派 済 源 潮 激 灰 熟 片 班 異 疑 痛 皇 盛 盟 看 砂 磁 私 秘 穀 穴 窓 筋 策 簡 糖 系 紅 納 純 絹 縦 縮 署 翌 聖 肺 背 胸 脳 腹 臓 臨 至 若 著 蒸 蔵 蚕 衆 裁 装 裏 補 視 覧 討 訪 訳 詞 誌 認 誕 誠 誤 論 諸 警 貴 賃 遺 郵 郷 針 鋼 閉 閣 降 陛 除 障 難 革 頂 骨",
  중학교:
    "丈 与 且 丘 丙 丹 乏 乙 乾 了 互 井 亜 享 亭 介 仙 仰 企 伏 伐 伯 伴 伸 伺 但 佐 佳 併 侍 依 侮 侯 侵 促 俊 俗 俸 倒 倣 倫 倹 偉 偏 偵 偶 偽 傍 傑 傘 催 債 傾 僕 僚 僧 儀 儒 償 充 克 免 兼 冒 冗 冠 准 凍 凝 凡 凶 凸 凹 刃 刈 刑 到 刺 削 剖 剛 剣 剤 剰 劣 励 劾 勅 勘 募 勧 勲 勺 匁 匠 匹 匿 升 卑 卓 占 即 却 卸 厄 厘 又 及 双 叔 叙 叫 召 吉 吏 吐 吟 含 吹 呈 呉 咲 哀 哲 唆 唇 唐 唯 啓 喚 喝 喪 喫 嗣 嘆 嘱 噴 嚇 囚 圏 坊 坑 坪 垣 埋 執 培 堀 堅 堕 堤 堪 塀 塁 塊 塑 塔 塗 塚 塾 墜 墨 墳 墾 壁 壇 壊 壌 壮 壱 奇 奉 契 奔 奥 奨 奪 奴 如 妃 妄 妊 妙 妥 妨 姓 姫 姻 威 娘 娠 娯 婆 婚 婿 媒 嫁 嫌 嫡 嬢 孔 孤 宜 宰 宴 宵 寂 寛 寝 寡 寧 審 寮 寿 封 尉 尋 尚 尼 尽 尾 尿 屈 履 屯 岐 岬 岳 峠 峡 峰 崇 崎 崩 巡 巧 巨 帆 帝 帥 帽 幅 幣 幻 幽 幾 床 庶 庸 廃 廉 廊 廷 弊 弐 弔 弦 弧 弾 彩 彫 彰 影 彼 征 徐 御 循 微 徴 徹 忌 忍 忙 怒 怖 怠 怪 恋 恐 恒 恥 恨 恭 恵 悔 悟 悠 患 悦 悩 悼 惑 惜 惨 惰 愁 愉 愚 慈 慌 慎 慕 慢 慨 慮 慰 慶 憂 憎 憤 憩 憶 憾 懇 懐 懲 懸 戒 戯 戻 房 扇 扉 払 扱 扶 抄 把 抑 抗 抜 択 披 抱 抵 抹 押 抽 拍 拐 拒 拓 拘 拙 拠 括 拷 挑 挟 振 挿 捕 捜 据 掃 掌 排 掘 掛 控 措 掲 描 揚 換 握 援 揺 搬 搭 携 搾 摂 摘 摩 撃 撤 撮 撲 擁 擦 擬 攻 敏 敢 敷 斉 斎 斗 斜 斤 斥 施 旋 既 旨 旬 昆 昇 是 普 晶 暁 暇 暦 暫 曇 更 曹 替 朕 朱 朴 朽 杉 杯 析 枠 枢 枯 架 柄 某 柔 柳 栓 核 栽 桃 桑 桟 棄 棋 棚 棟 棺 楼 概 槽 欄 欧 欺 款 歓 歳 殉 殊 殖 殴 殻 殿 汁 汗 汚 江 沈 沖 没 沢 沸 沼 況 泊 泌 泡 泥 泰 洞 津 洪 浄 浜 浦 浪 浮 浸 涙 涯 涼 淑 淡 添 渇 渉 渋 渓 渡 渦 湾 湿 溝 溶 滅 滋 滑 滝 滞 滴 漂 漆 漏 漠 漫 漬 漸 潜 潟 潤 澄 濁 濃 濫 濯 瀬 炉 炊 炎 為 烈 焦 煙 煩 煮 燥 爆 爵 牲 犠 狂 狩 狭 猛 猟 猫 献 猶 猿 獄 獣 獲 玄 珍 珠 琴 環 璽 瓶 甘 甚 甲 畔 畜 畝 畳 疎 疫 疲 疾 症 痘 痢 痴 療 癒 癖 皆 盆 盗 監 盤 盲 盾 眠 眺 睡 督 瞬 矛 矯 砕 砲 硝 硫 硬 碁 碑 磨 礁 礎 祈 祉 祥 禅 禍 秀 租 秩 称 稚 稲 稼 稿 穂 穏 穫 突 窃 窒 窮 窯 竜 端 符 筒 箇 範 篤 簿 籍 粋 粒 粗 粘 粛 粧 糧 糾 紋 紛 紡 索 紫 累 紳 紹 紺 絞 絡 継 維 綱 網 緊 緒 締 緩 緯 縁 縄 縛 縫 繁 繊 繕 繭 繰 缶 罰 罷 羅 翁 翻 翼 耐 耗 聴 肌 肖 肝 肢 肩 肪 肯 胆 胎 胞 胴 脂 脅 脚 脱 脹 腐 腕 腰 膚 膜 膨 臭 致 舗 舞 舟 般 舶 艇 艦 芋 芝 芳 苗 茂 茎 荒 荘 菊 菌 菓 華 葬 蓄 薄 薦 薪 薫 藩 藻 虐 虚 虜 虞 蚊 蛇 蛍 蛮 融 衝 衡 衰 衷 袋 被 裂 裕 裸 褐 褒 襟 襲 覆 覇 触 訂 託 訟 訴 診 詐 詔 詠 詰 該 詳 誇 誉 誓 誘 請 諭 諮 諾 謀 謁 謄 謙 謡 謹 譜 譲 豚 豪 貞 貢 販 貫 賄 賊 賓 賜 賠 賢 賦 購 贈 赦 赴 超 越 趣 距 跡 跳 践 踊 踏 躍 軌 軒 軟 軸 較 載 輝 輩 轄 辛 辱 込 迅 迎 迫 迭 逃 透 逐 逓 途 逝 逮 逸 遂 遅 遇 遍 違 遣 遭 遮 遵 遷 避 還 邦 邪 邸 郊 郎 郭 酌 酔 酢 酪 酬 酵 酷 醜 醸 釈 釣 鈍 鈴 鉛 鉢 銃 銑 銘 鋭 鋳 錘 錠 錬 錯 鍛 鎖 鎮 鐘 鑑 閑 閥 閲 闘 阻 附 陣 陥 陪 陰 陳 陵 陶 隅 隆 随 隔 隠 隣 隷 隻 雄 雅 雇 雌 離 雰 零 雷 需 震 霜 霧 露 靴 韻 響 項 頑 頒 頻 頼 顕 顧 飢 飽 飾 餓 香 駄 駆 駐 騎 騒 騰 驚 髄 髪 鬼 魂 魅 魔 鮮 鯨 鶏 麗 麻 黙 鼓 齢",
};

const KAKUSUU_KANJI_STRINGS = {
  "1획": "一 丶 丿 乙 亅",
  "2획":
    "丁 七 乂 乃 九 了 二 亠 人 儿 入 八 冂 冖 冫 几 凵 刀 力 勹 匕 匚 匸 十 卜 卩 厂 厶 又",
  "3획":
    "万 丈 三 上 下 与 个 丸 久 之 乞 也 于 亡 兀 凡 刃 刄 勺 千 叉 及 口 囗 土 士 夂 夊 夕 大 女 子 孑 宀 寸 小 尢 尸 屮 山 巛 川 工 己 已 巳 巾 干 幺 广 廴 廾 弋 弓 彑 彡 彳 才",
  "4획":
    "不 丐 丑 中 丹 乏 乢 予 云 互 五 井 亢 什 仁 仂 仄 仆 仇 今 介 仍 从 仏 允 元 公 六 兮 内 円 冗 凶 分 切 刈 勾 勿 匁 匂 化 匹 区 卅 卆 升 午 卞 厄 友 双 反 収 壬 天 太 夫 夬 夭 孔 少 尤 尹 尺 屯 巴 幻 廿 弌 弔 引 弖 心 戈 戸 手 扎 支 攴 攵 文 斗 斤 方 无 旡 日 曰 月 木 欠 止 歹 殳 毋 比 毛 氏 气 水 火 爪 父 爻 爿 片 牙 牛 犬 王",
  "5획":
    "且 丕 世 丗 丘 丙 丱 主 丼 乍 乎 仔 仕 他 仗 付 仙 仞 仟 代 令 以 仭 兄 冉 冊 册 写 冬 処 凧 凸 凹 出 刊 刋 功 加 包 匆 北 匝 卉 半 占 卮 卯 去 古 句 叨 叩 只 召 叭 叮 可 台 叱 史 右 叶 号 司 叺 囘 囚 四 圦 圧 外 夘 央 失 夲 奴 孕 它 尓 尻 尼 屶 左 巧 巨 市 布 平 幼 庁 広 弁 弍 弗 弘 必 戉 戊 打 払 斥 旦 旧 未 末 本 札 朮 正 母 民 氷 永 氾 汀 汁 犯 玄 玉 瓦 甘 生 用 田 由 甲 申 疋 癶 白 皮 皿 目 矛 矢 石 示 礼 禾 穴 立 艾 辷 辺 込",
  "6획":
    "丞 両 争 亘 亙 交 亥 亦 仮 仰 仲 件 价 任 企 伉 伊 伍 伎 伏 伐 休 会 伜 伝 充 兆 兇 先 光 全 共 再 冰 冱 冲 决 凩 凪 刎 刑 刔 列 劣 匈 匠 匡 卍 印 危 叫 吁 吃 各 合 吉 吊 吋 同 名 后 吏 吐 向 吸 回 因 団 在 圭 地 圷 圸 壮 夙 多 夛 夷 夸 奸 好 妁 如 妃 妄 字 存 宅 宇 守 安 寺 尖 尽 屹 州 巡 帆 年 幵 并 庄 式 弐 弛 当 忖 忙 戌 戍 戎 成 托 扛 扞 扠 扣 扨 扱 收 攷 旨 早 旬 旭 曲 曳 有 朱 朴 朶 朷 朸 机 朽 朿 杁 次 此 死 毎 気 汎 汐 汕 汗 汚 汝 江 池 汢 灯 灰 牝 牟 犲 瓜 百 竹 米 糸 缶 网 羊 羽 老 考 而 耒 耳 聿 肉 肋 肌 自 至 臼 舌 舛 舟 艮 色 艸 芋 芒 芝 虍 虫 血 行 衣 襾 西 赱 辻 迅 阡",
  "7획":
    "串 乕 乱 亊 亜 亨 伯 估 伴 伶 伸 伺 似 伽 佃 但 佇 位 低 住 佐 佑 体 何 佗 余 佚 佛 作 佝 佞 克 兌 兎 児 兵 冏 冴 况 冶 冷 初 判 別 刧 利 刪 助 努 劫 劬 劭 励 労 匣 医 即 却 卵 君 吝 吟 吠 否 吩 含 听 吭 吮 吶 吹 吻 吼 吽 吾 呀 呂 呆 呈 呉 告 呎 呑 囮 困 囲 図 圻 址 坂 均 坊 坎 坏 坐 坑 壯 声 壱 売 夾 妊 妍 妓 妖 妙 妛 妝 妣 妥 妨 孚 孛 孜 孝 宋 完 宍 宏 対 寿 尨 尾 尿 局 屁 岌 岐 岑 岔 巫 巵 帋 希 庇 床 序 廷 弃 弄 弟 形 彷 役 忌 忍 志 忘 応 忤 快 忰 忱 忸 忻 我 戒 戻 扮 扶 批 扼 找 技 抂 抃 抄 抉 把 抑 抒 抓 抔 投 抖 抗 折 抛 抜 択 攸 改 攻 斈 旱 更 曵 杆 杉 李 杏 材 村 杓 杖 杙 杜 杞 束 杠 条 杢 杣 杤 来 求 汞 汨 汪 汰 汲 汳 決 汽 汾 沁 沂 沃 沈 沌 沍 沐 沒 沖 沙 沚 沛 没 沢 泛 灸 灼 災 牡 牢 状 犹 狂 狃 狄 狆 玖 瓧 甫 甬 男 甸 町 甼 疔 皀 皃 矣 社 禿 秀 私 究 竍 糺 系 罕 肓 肖 肘 肚 肛 肝 臣 良 芍 芙 芟 芥 芦 芫 芬 芭 芯 花 芳 芸 芹 苅 見 角 言 谷 豆 豕 豸 貝 赤 走 足 身 車 辛 辰 辿 迂 迄 迎 近 返 邑 那 邦 邨 酉 釆 里 阨 阪 阮 阯 防 麦",
  "8획":
    "並 乖 乳 事 些 亞 亟 享 京 佩 佯 佰 佳 併 佶 佻 佼 使 侃 來 侈 例 侍 侏 侑 侖 侘 供 依 侠 価 侫 侭 侮 免 兒 兔 兩 其 具 典 冐 冽 凭 函 刮 到 刳 制 刷 券 刹 刺 刻 劵 効 劼 劾 卒 卓 協 卦 卷 参 叔 取 受 呟 周 呪 呱 味 呵 呶 呷 呻 呼 命 咀 咄 咆 咋 和 咎 咏 咐 咒 囹 固 国 坡 坤 坦 坩 坪 坿 垂 垈 垉 夜 奄 奇 奈 奉 奔 妬 妲 妹 妻 妾 姆 姉 始 姐 姑 姓 委 孟 季 孥 学 宕 宗 官 宙 定 宛 宜 宝 実 尚 尭 居 屆 屈 届 岡 岨 岩 岫 岬 岱 岳 岶 岷 岸 岻 岼 岾 峅 帑 帖 帙 帚 帛 幸 底 庖 店 庚 府 延 廸 弥 弦 弩 彼 彿 往 征 徂 徃 径 忝 忠 念 忽 忿 怏 怐 怕 怖 怙 怛 怜 怡 怦 性 怩 怪 怫 怯 怺 戔 或 房 所 承 披 抬 抱 抵 抹 抻 押 抽 拂 担 拆 拇 拈 拉 拊 拌 拍 拐 拑 拒 拓 拔 拗 拘 拙 招 拝 拠 拡 放 斉 斧 於 旺 旻 昂 昃 昆 昇 昊 昌 明 昏 易 昔 朋 服 杪 杭 杯 杰 東 杲 杳 杵 杷 杼 松 板 枅 枇 枉 枋 枌 析 枕 林 枚 果 枝 枠 枡 枢 枦 枩 欣 欧 武 歩 歿 殀 殴 毒 毟 氓 氛 沓 沫 沮 沱 河 沸 油 沺 治 沼 沽 沾 沿 況 泄 泅 泊 泌 泓 法 泗 泙 泝 泡 波 泣 泥 注 泪 泯 泱 泳 炉 炊 炎 炒 炙 爬 爭 牀 版 牧 物 狎 狒 狗 狙 狛 玩 瓩 画 畄 疚 疝 的 盂 盲 直 知 矼 祀 祁 祇 祈 祉 秉 穹 空 突 竏 竺 籵 罔 羌 者 股 肢 肥 肩 肪 肬 肭 肯 肱 育 肴 舍 舎 芽 苑 苒 苓 苔 苗 苙 苛 苜 苞 苟 苡 苣 若 苦 苧 苫 英 苳 苴 苹 苺 苻 茂 范 茄 茅 茆 茉 茎 虎 虱 表 衫 軋 迚 迩 迪 迫 迭 述 邪 邯 邱 邵 邸 采 金 長 門 阜 阻 阿 陀 陂 附 隶 隹 雨 青 非 鼡",
  "9획":
    "乘 亭 亮 亰 侯 侵 侶 便 係 促 俄 俊 俎 俐 俑 俔 俗 俘 俚 俛 保 俟 信 俣 俤 俥 兪 冑 冒 冠 凾 剃 剄 則 削 剋 剌 前 剏 勁 勃 勅 勇 匍 卑 南 単 卸 卻 厖 厘 厚 叙 叛 呰 咢 咤 咥 咨 咫 咬 咯 咲 咳 咸 咼 咽 咾 哀 品 哂 哄 哇 哈 哉 哘 囿 圀 型 垓 垠 垢 垣 垤 垪 垰 垳 城 変 奎 奏 奐 契 奕 姙 姚 姜 姥 姦 姨 姪 姶 姻 姿 威 娃 孤 孩 客 宣 室 宥 封 専 屋 屍 屎 屏 峇 峙 峠 峡 巷 巻 帝 帥 幽 庠 度 建 廻 廼 弧 弭 弯 彖 彦 待 徇 很 徊 律 後 怎 怒 思 怠 急 怨 怱 恂 恃 恆 恊 恍 恒 恟 恠 恢 恤 恨 恪 恫 恬 恰 悔 扁 拏 拜 括 拭 拮 拯 拱 拵 拶 拷 拾 持 挂 指 按 挌 挑 挟 挧 政 故 斫 施 昜 星 映 春 昧 昨 昭 是 昴 昵 昶 昼 昿 曷 朏 枯 枳 枴 架 枷 枸 枹 柁 柄 柆 柊 柎 柏 某 柑 染 柔 柘 柚 柝 柞 柢 柤 柩 柬 柮 柯 柱 柳 柵 査 柾 柿 栂 栃 栄 歪 殃 殄 殆 段 毘 泉 洋 洌 洒 洗 洙 洛 洞 洟 津 洩 洪 洫 洲 洳 洵 洶 洸 活 洽 派 浄 浅 海 炬 炭 炮 炯 炳 炸 点 為 爰 爼 牲 牴 狐 狠 狡 狢 狩 独 狭 玲 玳 玻 珀 珂 珈 珊 珍 珎 瓮 瓰 瓱 瓲 甚 畆 畉 畊 畋 界 畍 畏 畑 疣 疥 疫 癸 発 皆 皇 皈 盃 盆 盈 相 盻 盾 省 眄 眇 眈 眉 看 県 矜 矧 砂 砌 砒 研 砕 祐 祖 祝 神 祢 禹 禺 秋 科 秒 秕 穽 穿 窃 竒 竓 竕 竿 笂 籾 粁 粂 糾 紀 紂 約 紅 紆 級 缸 罘 美 耐 耶 肺 胃 胄 胆 背 胎 胖 胙 胚 胛 胝 胞 胡 胤 胥 脉 臥 臭 臾 舁 茖 茗 茘 茜 茨 茫 茯 茱 茲 茴 茵 茶 茸 茹 荀 荅 草 荊 荏 荐 荒 荘 莽 虐 虹 虻 衂 衍 衲 衵 衽 衿 袂 要 訂 訃 計 貞 負 赴 軌 軍 迢 迥 迦 迯 迷 追 退 送 逃 逆 郁 郊 郎 酊 酋 重 閂 陋 陌 陏 限 面 革 韭 音 頁 風 飛 食 首 香 鳬",
  "10획":
    "乘 亳 修 俯 俳 俵 俶 俸 俺 俾 倅 倆 倉 個 倍 們 倒 倔 倖 候 倚 借 倡 倣 値 倥 倦 倨 倩 倪 倫 倬 倭 倶 倹 党 兼 冓 冢 冤 冥 冦 凄 凅 准 凉 凋 凌 凍 剔 剖 剛 剞 剣 剤 剥 勉 勍 匪 匿 原 叟 員 哢 哥 哦 哨 哩 哭 哮 哲 哺 哽 唄 唆 唇 唏 唐 唔 唖 唳 啄 圃 圄 埀 埃 埆 埋 埒 埓 埔 埖 夏 套 奘 奚 姫 娉 娑 娘 娚 娜 娟 娠 娥 娩 娯 孫 宦 宮 宰 害 宴 宵 家 宸 容 射 尅 将 屐 屑 屓 展 峨 峩 峪 峭 峯 峰 島 峺 峻 峽 崋 差 師 席 帯 帰 座 庫 庭 弉 弱 徐 徑 徒 従 恁 恋 恐 恕 恙 恚 恣 恥 恩 恭 息 恵 恷 悁 悃 悄 悋 悌 悍 悒 悖 悗 悚 悛 悟 悦 悧 悩 扇 拳 拿 挈 挙 挨 挫 振 挺 挽 挾 挿 捉 捌 捍 捏 捐 捕 捗 捜 捩 效 敏 料 旁 旃 旄 旅 旆 既 晁 時 晃 晄 晉 晋 晏 晒 晟 書 朔 朕 朗 柧 柴 栓 栖 栗 栞 校 栢 栩 株 栫 栲 栴 核 根 格 栽 桁 桂 桃 框 案 桍 桎 桐 桑 桓 桔 桙 桜 桟 档 桧 梅 殉 殊 残 殷 殺 氣 氤 泰 流 浙 浚 浜 浣 浤 浦 浩 浪 浬 浮 浴 浸 浹 涅 消 涌 涎 涓 涕 涙 涛 涜 烈 烋 烏 烙 烝 烟 特 狷 狸 狹 狼 狽 珞 珠 珥 珪 班 珮 珱 畔 留 畚 畛 畜 畝 畠 疱 疲 疳 疸 疹 疼 疽 疾 痂 痃 病 症 皋 皰 益 盍 眛 眞 真 眠 眤 眩 矩 砠 砥 砧 砲 破 砺 砿 祓 祕 祗 祚 祟 祠 祥 秘 租 秡 秣 秤 秦 秧 秩 秬 称 窄 窈 站 竚 竜 竝 笄 笆 笈 笊 笋 笏 笑 粃 粉 粋 粍 粐 紊 紋 納 紐 純 紕 紗 紘 紙 紛 紜 素 紡 索 缺 罟 罠 羔 翁 翅 翆 耄 耆 耕 耗 耘 耙 耻 耽 耿 胯 胱 胴 胸 胼 能 脂 脅 脆 脇 脈 脊 致 舐 舩 航 舫 般 舮 芻 茣 荳 荵 荷 荻 荼 莅 莇 莉 莊 莎 莖 莚 莞 莟 莠 莢 莨 莪 莫 莱 莵 華 虔 蚊 蚋 蚌 蚓 蚕 蚣 蚤 蚩 蚪 衄 衰 衷 衾 袁 袍 袒 袖 袗 袙 袢 被 袮 訊 訌 討 訐 訓 訖 託 記 豈 豹 豺 財 貢 赳 起 躬 軒 辱 迴 迸 迹 迺 逅 透 逐 逓 途 通 逝 速 造 連 郛 郡 郢 郤 酌 配 酎 酒 釖 釘 釛 釜 針 釟 釡 閃 降 陛 陜 陝 陞 陟 院 陣 除 陥 陦 隻 隼 韋 飢 馬 骨 高 髟 鬥 鬯 鬲 鬼",
  "11획":
    "乾 亀 倏 偃 假 偈 偏 偐 偕 偖 做 停 健 偬 偲 側 偵 偶 偸 偽 兜 冕 冨 凰 剪 副 剰 剱 剳 勒 動 勗 勘 務 匏 匐 匙 區 厠 參 售 唯 唱 唸 唹 唾 啀 啅 商 啌 問 啓 啖 啗 啜 啝 喝 圈 圉 國 埜 域 埠 埣 埴 執 培 基 埼 堀 堂 堆 堊 堋 壷 娵 娶 娼 婀 婁 婆 婉 婚 婢 婦 婪 婬 孰 宿 寂 寃 寄 寅 密 寇 寉 將 專 尉 崇 崎 崑 崔 崕 崖 崗 崘 崙 崚 崛 崟 崢 崩 嶌 巣 帳 帶 帷 常 庵 庶 康 庸 張 強 弸 彗 彩 彪 彫 彬 得 徘 徙 從 徠 悉 悠 患 悪 悴 悵 悸 悼 悽 情 惆 惇 惓 惘 惚 惜 惟 惧 惨 戚 戛 戝 扈 捧 捨 捫 据 捲 捶 捷 捺 捻 掀 掃 授 掉 掎 掏 排 掖 掘 掛 掟 掠 採 探 接 控 推 掩 措 掫 掬 掲 掴 掵 掻 描 敍 救 敕 敖 敗 敘 教 斎 斛 斜 斬 断 旋 旌 族 晝 晞 晢 晤 晦 晧 晨 曹 曼 曽 朖 望 桀 桝 桴 桶 桷 桾 桿 梁 梃 梍 梏 梓 梔 梗 梛 條 梟 梠 梢 梦 梧 梨 梭 梯 械 梱 梳 梵 梶 梹 梺 梼 椛 欲 欷 欸 殍 殻 毫 毬 涯 液 涵 涸 涼 淀 淅 淆 淇 淋 淌 淑 淒 淕 淘 淙 淞 淡 淤 淦 淨 淪 淫 淬 淮 深 淳 混 淹 淺 添 清 渇 済 渉 渊 渋 渓 渕 渚 渮 烱 烹 烽 焉 焔 爽 牽 牾 犁 猊 猖 猗 猛 猜 猝 猟 猪 猫 率 珸 現 球 琅 理 琉 琢 瓠 瓶 瓷 瓸 甜 産 畢 畤 略 畦 畧 畩 異 疵 痊 痍 痒 痔 痕 皎 皐 盒 盖 盗 盛 眥 眦 眷 眸 眺 眼 砦 硅 票 祭 祷 移 窒 窓 窕 竟 章 竡 笘 笙 笛 笞 笠 笥 符 笨 第 笳 笵 笶 笹 粒 粕 粗 粘 粛 紬 紮 累 細 紲 紳 紵 紹 紺 紿 終 絃 組 絅 絆 絋 経 羚 羝 羞 翊 翌 習 耜 聆 聊 脚 脛 脣 脩 脯 脱 脳 舂 舳 舵 舶 舷 舸 船 莓 菁 菅 菊 菌 菎 菓 菖 菘 菜 菠 菩 菫 菱 菲 菴 菷 菻 菽 萃 萄 萇 萋 萌 萍 萎 萓 萠 萢 著 處 虚 蚫 蚯 蚰 蚶 蛄 蛆 蛇 蛉 蛋 蛍 蛎 衒 術 袈 袋 袞 袤 袰 袱 袴 袵 袷 袿 裃 裄 規 覓 視 訛 訝 訟 訣 訥 訪 設 許 訳 豚 豼 貧 貨 販 貪 貫 責 貭 貮 貶 赦 趺 趾 跂 躯 軛 軟 転 軣 逋 逍 逎 逑 逕 逖 逗 這 逞 逡 逢 逧 逮 週 進 逸 部 郭 郵 郷 都 酔 酖 酘 釈 野 釣 釦 釧 釵 釶 釼 閇 閉 閊 陪 陬 陰 陲 陳 陵 陶 陷 陸 険 隆 雀 雪 雫 頂 頃 馗 魚 鳥 鹵 鹿 麥 麸 麻 黄 黒",
  "12획":
    "偉 傀 傅 傍 傘 備 傚 凖 凱 剩 割 剴 創 勝 勞 募 勤 博 卿 厥 厦 厨 啣 啻 啼 啾 喀 喃 善 喇 喉 喊 喋 喘 喙 喚 喜 喞 喟 喧 喨 喩 喪 喫 喬 單 喰 営 圍 圏 堅 堕 堙 堝 堡 堤 堪 堯 堰 報 場 堵 堺 塀 塁 塔 塚 壹 壺 壻 奠 奢 奥 婿 媒 媚 媛 嫂 孱 孳 富 寐 寒 寓 寔 尊 尋 就 属 屠 屡 嵋 嵌 嵎 嵐 嵒 嵜 巽 帽 幀 幃 幄 幅 幇 幾 廁 廂 廃 廊 弑 弼 弾 彭 御 徨 復 循 悲 悳 悶 惑 惠 惡 惣 惰 惱 惴 惶 惹 惺 惻 愀 愃 愉 愎 愕 愡 慌 戞 戟 扉 掌 掣 掾 揀 揃 揄 揆 揉 提 插 揖 揚 換 握 揣 揩 揮 援 揶 揺 搜 搭 敝 敞 敢 散 敦 敬 斌 斐 斑 斯 晩 普 景 晰 晴 晶 智 暁 暃 暎 暑 曾 替 最 朝 朞 期 棆 棉 棊 棋 棍 棒 棔 棕 棗 棘 棚 棟 棠 棡 棣 棧 森 棯 棲 棹 棺 椀 椁 椄 椅 椈 椋 椌 植 椎 椏 椒 椙 椚 検 椡 椢 椣 椥 椦 椨 椪 極 欹 欺 欽 款 歯 殕 殖 殘 殼 毯 毳 淵 渙 減 渝 渟 渠 渡 渣 渤 渥 渦 温 渫 測 渭 港 游 渺 渾 湃 湊 湍 湎 湖 湘 湛 湟 湧 湫 湮 湯 湲 湶 湾 湿 満 溂 溌 滋 焙 焚 焜 無 焦 然 焼 煮 爲 牋 牌 犀 犂 犇 猥 猩 猯 猴 猶 琥 琲 琳 琴 琵 琶 琺 瑛 甥 甦 番 畫 畭 畳 畴 疎 疏 痘 痙 痛 痞 痢 痣 痩 登 發 皓 皖 皴 盜 着 睇 短 硝 硫 硬 硯 硲 硴 禄 稀 稈 程 稍 税 窖 窗 窘 竢 竣 童 竦 筅 筆 筈 等 筋 筌 筍 筏 筐 筑 筒 答 策 筝 筬 粟 粡 粢 粤 粥 粧 粨 粫 粭 紫 絎 絏 結 絖 絞 絡 絢 絣 給 絨 絮 統 絲 絳 絵 絶 翔 翕 耋 聒 脹 脾 腆 腋 腑 腓 腔 腕 舒 菟 菰 萩 萪 萬 萱 萵 萸 萼 落 葆 葉 葎 葛 葡 葢 董 葩 葫 葬 葭 葮 葯 葱 葵 葷 葹 葺 蒂 蒄 蛔 蛙 蛛 蛞 蛟 蛤 蛩 蛬 蛭 蛮 蛯 衆 街 裁 裂 装 裕 裙 補 裡 覃 覗 覘 覚 觚 觝 訴 訶 診 註 証 詁 詆 詈 詐 詑 詒 詔 評 詛 詞 詠 谺 象 貂 貯 貰 貳 貴 買 貸 費 貼 貽 貿 賀 賁 赧 趁 超 越 跋 跌 跏 跖 跚 跛 距 躰 軫 軸 軻 軼 軽 辜 逵 逶 逹 遂 遅 遇 遊 運 遍 過 遏 道 達 遥 鄂 酢 酣 酥 釉 量 釿 鈍 鈎 鈑 鈔 鈕 鈞 鈩 鈬 開 閏 閑 間 閔 閖 陽 隅 隈 隊 隋 隍 階 随 雁 雄 集 雇 雋 雰 雲 靫 靭 靱 韮 項 順 須 颪 飯 飲 馭 馮 黍 黹",
  "13획":
    "亂 亶 傑 催 傭 傲 傳 傴 債 傷 傾 僂 僅 僉 働 僧 剽 剿 勠 勢 勣 勦 勧 匯 嗄 嗅 嗇 嗔 嗚 嗜 嗟 嗣 嗤 嘆 嘩 園 圓 堽 塊 塋 塑 塒 塗 塘 塙 塞 塢 塩 填 塰 墓 壼 夢 奧 奨 媼 媽 媾 嫁 嫉 嫋 嫌 嫐 寛 寝 寞 尠 嵩 嵬 嵯 嵳 嵶 幌 幎 幕 幹 廈 廉 彁 彙 徭 微 想 惷 愁 愆 愈 愍 意 愚 愛 感 愧 愴 愽 愾 慄 慈 慊 慍 慎 慨 戡 戦 搆 損 搏 搓 搖 搗 搦 搨 搬 搶 携 搾 摂 摸 数 斟 新 旒 暄 暇 暈 暉 暖 暗 暘 會 棄 椰 椴 椶 椹 椽 椿 楊 楓 楔 楕 楙 楚 楜 楝 楞 楠 楡 楢 楪 楫 業 楮 楯 楳 楴 楷 楸 楹 楼 楽 楾 榁 歃 歇 歳 殿 毀 溏 源 準 溘 溜 溝 溟 溢 溥 溪 溯 溲 溶 溷 溺 溽 滂 滄 滅 滉 滑 滓 滔 滝 滞 漠 漢 煉 煌 煎 煖 煙 煢 煤 煥 煦 照 煩 煬 爺 牒 献 猷 猾 猿 獅 獏 琿 瑁 瑕 瑙 瑚 瑜 瑞 瑟 瑶 甞 當 畷 畸 痰 痲 痳 痴 痺 痼 痾 痿 瘁 皙 盞 盟 睚 睛 睡 督 睥 睦 睨 睫 矮 硼 碁 碆 碇 碌 碍 碎 碓 碕 碗 碚 祺 祿 禀 禁 禅 禍 禎 福 禽 稔 稗 稘 稙 稚 稜 稟 稠 窟 筥 筧 筮 筰 筱 筴 筵 筺 節 粮 粱 粲 粳 糀 絛 絹 絽 綉 綏 經 継 続 綛 綟 罧 罨 罩 罪 罫 置 署 羣 群 羨 義 耡 聖 聘 肄 肅 肆 腎 腟 腥 腦 腫 腮 腰 腱 腴 腸 腹 腺 舅 與 舜 艀 艇 葦 蒋 蒐 蒔 蒙 蒜 蒟 蒡 蒭 蒲 蒸 蒹 蒻 蒼 蒿 蓁 蓄 蓆 蓉 蓊 蓋 蓍 蓐 蓑 蓖 蓙 蓚 蓮 虜 虞 號 蛸 蛹 蛻 蛾 蜀 蜂 蜃 蜆 蜈 蜉 蜊 蜍 蜑 蜒 衙 裏 裔 裘 裝 裟 裨 裲 裸 裼 裾 褂 褄 褐 觜 解 触 觧 詢 詣 試 詩 詫 詬 詭 詮 詰 話 該 詳 詼 誂 誄 誅 誇 誉 誠 豊 豢 貅 貉 貊 貲 賂 賃 賄 資 賈 賊 賍 賎 跟 跡 跣 跨 跪 跫 路 跳 践 躱 軾 較 輅 載 輊 輌 辞 辟 農 逼 逾 遁 遉 遐 遑 遒 違 遖 遠 遣 鄒 酩 酪 酬 鈴 鈷 鈿 鉄 鉅 鉈 鉉 鉋 鉐 鉗 鉚 鉛 鉞 鉢 鉤 鉦 鉱 閘 閙 閠 隔 隕 隗 隘 隙 雅 雉 雍 雎 零 雷 雹 電 靖 靴 靹 韵 頌 頏 預 頑 頒 頓 飩 飫 飭 飮 飼 飽 飾 馳 馴 骭 髢 鳧 鳩 鳫 鳰 麁 黽 鼎 鼓 鼠",
  "14획":
    "僊 像 僑 僕 僖 僚 僞 僣 僥 僭 僮 儁 兢 劃 匱 厩 厭 厮 厰 嗷 嗹 嗽 嗾 嘉 嘔 嘖 嘗 嘘 嘛 圖 團 塲 塵 塹 塾 境 墅 増 墨 壽 夐 夥 奩 奪 奬 嫖 嫗 嫡 嫣 嫦 嫩 孵 察 寡 寢 寤 寥 實 寧 寨 對 層 嶂 嶄 嶇 嶋 幔 幗 廏 廐 廓 廖 彰 徳 徴 愨 愬 愼 愿 慂 慇 態 慓 慕 慘 慚 慝 慟 慢 慣 慥 慯 慱 慴 慵 慷 憎 截 搴 摎 摘 摧 摶 摺 敲 斡 旗 暝 暢 暦 暮 曄 概 榊 榎 榑 榔 榕 榛 榜 榠 榧 榮 榱 榲 榴 榻 榾 榿 槁 槃 槇 槊 構 槌 槍 槎 槐 槓 様 槙 槝 槞 模 樮 樺 歉 歌 歴 殞 毓 滌 滬 滯 滲 滴 滷 滸 滾 滿 漁 漂 漆 漉 漏 漑 漓 演 漕 漣 漫 漬 漱 漲 漸 漾 潅 煕 煽 熄 熊 熏 熔 熕 爾 犒 犖 獄 瑠 瑣 瑤 瑪 瑯 瑰 瑳 甃 甄 甅 疑 瘉 瘋 瘍 瘧 皷 皸 皹 盡 睹 睾 睿 碑 碣 碧 碩 碪 碯 碵 磁 禊 種 稱 稲 穀 窩 窪 竪 竭 端 竰 箆 箇 箋 箍 箏 箒 箔 箕 算 箘 箙 箚 箜 箝 箟 管 粹 粽 精 綜 綢 綣 綫 綬 維 綮 綯 綰 綱 網 綴 綵 綸 綺 綻 綽 綾 綿 緇 緋 総 緑 緒 緕 練 罰 翠 翡 聚 聞 聟 聡 聢 肇 腐 腿 膀 膂 膃 膈 膊 膏 膜 臺 蓬 蓴 蓼 蓿 蔀 蔆 蔑 蔓 蔔 蔕 蔗 蔘 蔚 蔟 蔡 蔦 蔭 蜘 蜚 蜜 蜥 蜩 蜴 蜷 蜻 蜿 蝋 裳 裴 裹 製 複 褊 褌 褓 褝 覡 誌 認 誑 誓 誘 誚 語 誡 誣 誤 誥 誦 誨 説 読 豪 貌 貍 賑 赫 趙 跼 跿 踈 踉 踊 輒 輓 輔 輕 辣 遘 遙 遜 遞 遡 適 遭 遮 鄙 酲 酳 酵 酷 酸 鉾 銀 銃 銅 銑 銓 銕 銖 銘 銚 銛 銜 銭 鋩 関 閣 閤 閥 閧 閨 際 障 隠 雌 雑 需 静 靤 靺 靼 鞁 鞄 鞅 鞆 韶 頗 領 頚 颯 颱 飴 馼 駁 駄 駅 駆 骰 髣 髦 髪 魁 魂 鳳 鳴 鳶 麼 鼻 齊",
  "15획":
    "僵 價 僻 儀 儂 億 儉 儚 冩 冪 凛 凜 劇 劈 劉 劍 勲 匳 嘱 嘲 嘶 嘸 噂 噌 噎 噛 器 噴 墜 墟 墫 墮 墳 墸 墹 嫺 嫻 嬉 嬋 嬌 審 寫 寮 導 履 嶐 嶝 嶢 幟 幡 幢 幣 幤 廚 廛 廝 廟 廠 廡 廢 廣 弊 彈 影 徹 慙 慧 慫 慮 慰 慳 慶 慾 憂 憇 憔 憚 憤 憧 憫 憬 憮 戮 戯 摩 摯 撃 撈 撒 撓 撕 撚 撞 撤 撥 撩 撫 播 撮 撰 撲 撹 敵 敷 數 暫 暴 槧 槨 槫 槭 槲 槹 槻 槽 槿 樂 樅 樊 樋 樌 樒 樓 樔 樗 標 樛 樞 樟 樢 樣 権 横 歎 歐 歓 殤 毅 毆 滕 漿 潁 潔 潘 潛 潜 潟 潤 潦 潭 潮 潯 潰 潴 潸 潺 潼 澁 澂 澄 澆 澎 澑 澗 濆 熈 熙 熟 熨 熬 熱 獎 獗 瑩 瑾 璃 璋 甍 畿 瘟 瘠 瘡 瘢 瘤 皚 皺 監 盤 瞋 瞎 瞑 確 碼 碾 磅 磆 磊 磋 磐 磑 禝 稷 稻 稼 稽 稾 稿 穂 穃 窮 窯 窰 箪 箭 箱 箴 箸 篁 範 篆 篇 篋 篌 篏 糂 糅 糊 糎 緊 緘 線 緜 緝 緞 締 緡 緤 編 緩 緬 緲 縁 縄 縅 罵 罷 罸 羮 羯 翦 翩 翫 聨 膓 膕 膚 膝 膠 膣 膤 膵 臧 舖 舗 舞 蔬 蔵 蔽 蕀 蕁 蕃 蕈 蕉 蕊 蕋 蕎 蕕 蕘 蕚 蕨 蕩 蕪 蝉 蝌 蝎 蝓 蝕 蝗 蝙 蝟 蝠 蝣 蝦 蝨 蝪 蝮 蝴 蝶 蝸 蝿 蟒 衝 褒 褞 褥 褪 褫 誕 誰 課 誹 誼 調 諂 諄 談 請 諌 諍 諏 諒 論 諚 諛 諸 諾 謁 豌 貎 賓 賚 賛 賜 賞 賠 賣 賤 賦 質 趣 踏 踐 踝 踞 踟 踪 輙 輛 輜 輝 輟 輦 輩 輪 遨 遯 遵 遷 選 遺 遼 鄭 鄰 鄲 醂 醇 醉 醋 銷 銹 鋏 鋒 鋤 鋪 鋭 鋲 鋳 錵 錺 閭 閲 霄 霆 震 霈 霊 靠 鞋 鞍 鞏 鞐 頡 頬 餃 餅 餉 養 餌 餓 駈 駐 駑 駒 駕 駘 駛 駝 駟 髫 髮 髯 髱 髴 鬧 魃 魄 魅 魯 魴 鴃 鴆 鴇 鴈 鴉 鴎 麩 麪 麹 麾 黎 黙 齒",
  "16획":
    "儒 儔 儕 儘 冀 凝 劑 劒 劔 勳 勵 叡 嘯 嘴 噐 噤 噪 噫 噬 噸 噺 嚆 圜 墺 墻 墾 壁 壅 壇 壊 壌 奮 嬖 嬢 學 寰 嶬 嶮 嶼 廨 廩 彊 彜 徼 憊 憐 憑 憖 憙 憩 憲 憶 憺 憾 懆 懈 懊 懌 懍 懐 戰 撻 撼 擁 擂 擅 擇 操 擒 擔 據 整 旙 暸 暹 暼 暾 曁 曇 曉 樫 樵 樶 樸 樹 樽 橄 橇 橈 橋 橘 橙 機 橡 橢 橦 橲 橸 檠 歔 歙 殪 殫 澡 澣 澤 澪 澱 澳 澹 激 濁 濂 濃 濛 濳 熹 熾 燃 燈 燉 燎 燒 燔 燕 燗 獣 獨 獪 獲 璞 璢 瓢 甌 甎 疂 瘰 瘴 瘻 盥 盧 瞞 瞠 磔 磚 磧 磨 磬 禦 穆 積 穎 穏 穐 窶 窺 築 篝 篤 篥 篦 篩 篭 簑 糒 糖 糘 糢 緯 緻 縉 縊 縋 縒 縛 縞 縟 縡 縢 縣 縦 縫 繁 罹 羲 翰 耨 膨 膩 膰 膳 臈 臻 興 舉 舘 艘 艙 蕗 蕣 蕭 蕷 蕾 薀 薄 薇 薈 薊 薐 薑 薔 薗 薙 薛 薜 薤 薦 薨 薪 薫 薬 薮 螂 融 螟 螢 蟆 蟇 衛 衞 衡 褶 褸 襁 覦 覩 親 諜 諞 諠 諡 諢 諤 諦 諧 諫 諭 諮 諳 諷 諺 謀 謂 謔 謡 豎 豫 豬 賢 賭 赭 踰 踴 踵 蹂 蹄 躾 輯 輳 輸 輹 輻 辧 辨 遲 遶 避 邁 還 醍 醐 醒 醗 鋸 鋺 鋼 錆 錏 錐 錘 錙 錚 錠 銭 錣 錦 錨 錫 錬 錮 錯 録 錻 鍄 閹 閻 閼 閾 隣 隧 隨 險 隷 雕 霍 霎 霏 霑 霓 霖 霙 靜 靦 鞘 頤 頭 頴 頷 頸 頼 頽 餐 餒 餔 餘 餝 館 駢 駭 駮 駱 駲 骸 骼 髭 髷 髻 鬨 鮃 鮎 鮑 鮒 鮓 鮖 鮗 鴒 鴕 鴛 鴟 鴣 鴦 鴨 鴪 鴫 鴬 麈 麭 麺 黔 默 黛 龍 龜",
  "17획":
    "儖 償 儡 優 厳 嚀 嚇 嚊 嚏 壑 壓 壕 壗 嬪 嬬 嬰 嬲 嬶 孺 嶷 嶺 嶽 彌 徽 懃 懇 應 懋 懦 戲 戴 擘 擠 擡 擢 擣 擦 擧 擬 擯 擱 斂 曖 曙 曚 朦 橿 檀 檄 檍 檎 檐 檗 檜 檢 檣 檪 檬 歛 歟 氈 澀 濔 濕 濘 濟 濠 濡 濤 濬 濮 濯 濱 濶 燐 營 燠 燥 燦 燧 燬 燭 燮 燵 爵 牆 犠 獰 環 甑 療 癆 癇 癈 癌 癘 盪 瞥 瞭 瞰 瞳 瞶 矯 磯 磴 磽 礁 禧 禪 穉 穗 窿 竃 篠 篳 篶 篷 簀 簇 簍 簒 簓 簔 簗 糜 糞 糟 糠 縮 縱 縲 縵 縷 縹 縺 縻 總 績 繃 繆 繊 繋 繍 罅 翳 翼 聯 聰 聲 聳 聴 膸 膺 膽 膾 膿 臀 臂 臆 臉 舊 艚 艝 艱 薩 薯 薹 薺 藁 藉 藐 虧 螫 螯 螳 螺 螻 螽 蟀 蟄 蟋 蟐 蠎 褻 襃 襄 襌 襍 覧 覬 覯 諱 謄 謇 謌 謎 謐 謖 謗 謙 謚 講 謝 謠 謨 謹 譁 谿 豁 貔 貘 賺 賻 購 賽 趨 蹇 蹈 蹉 蹊 蹌 蹐 輾 輿 轂 轄 轅 遽 邀 邂 邉 醜 醢 醤 鍋 鍍 鍔 鍖 鍛 鍜 鍠 鍬 鍮 鍵 鍼 鍾 闃 闇 闊 闌 闍 隰 隱 隲 隸 雖 霜 霞 鞜 鞠 頻 顆 颶 餞 餠 餡 餤 馘 駸 駻 駿 騁 鮟 鮠 鮨 鮪 鮫 鮭 鮮 鮴 鴻 鴾 鴿 鵁 鵄 鵆 鵈 麋 黏 黜 黝 點 黻 鼾 齋 齔 齢 龠",
  "18획":
    "儲 叢 嚔 嚠 嚢 壘 壙 彝 懣 懲 懴 戳 擲 擴 擶 擺 擽 擾 攅 斃 斷 旛 曜 檮 檳 檸 櫁 櫂 櫃 歸 殯 濫 濺 濾 瀁 瀉 瀋 瀏 瀑 燹 燻 燼 燿 獵 璧 瓊 甓 甕 癒 癖 癜 瞬 瞹 瞻 瞼 瞽 瞿 矇 礇 礎 礑 礒 禮 穡 穢 穣 穫 竄 竅 簟 簡 簣 簧 糧 織 繕 繖 繙 繚 繝 繞 繦 繧 繭 羂 羃 翹 翻 聶 職 臍 臑 臨 艟 藍 藏 藕 藜 藝 藤 藥 藩 藪 蟠 蟯 蟲 襖 襟 襠 覆 覲 観 觴 謦 謫 謬 謳 謾 豐 贄 贅 贈 蹕 蹙 蹟 蹠 蹣 蹤 轆 轉 轌 邃 邇 醪 醫 釐 鎌 鎔 鎖 鎗 鎚 鎧 鎬 鎭 鎮 鎰 鎹 闔 闕 闖 闘 雙 雛 雜 難 霤 鞣 鞦 鞨 鞫 鞭 鞳 韓 顋 題 額 顎 顏 顔 顕 類 餬 餮 馥 騅 騎 騏 騒 験 髀 鬆 鬩 魍 魎 魏 鮹 鯀 鯆 鯉 鯊 鯏 鯑 鯒 鵐 鵑 鵙 鵜 鵝 鵞 鵠 鵤 麌 麿 黠 鼕 鼬",
  "19획":
    "勸 嚥 嚮 壜 壞 壟 嬾 寳 寵 廬 懶 懷 攀 曝 曠 檻 櫑 櫓 櫚 櫛 櫞 櫟 殱 瀕 瀘 瀚 瀛 瀝 瀞 瀟 瀦 瀧 瀬 爆 爍 牘 犢 獸 獺 璽 瓣 疆 疇 癡 礙 礪 禰 穩 簫 簷 簸 簽 簾 簿 籀 繩 繪 繰 繹 羅 羆 羶 羸 羹 臓 臘 艢 艤 艶 藷 藹 藺 藻 藾 蘂 蘆 蘇 蘊 蘋 蘓 蘢 蘭 蟶 蟷 蟹 蟻 蟾 蠅 蠍 蠏 蠖 襞 襦 襪 覇 覈 證 譌 譎 譏 譖 識 譚 譛 譜 警 贇 贊 贋 蹲 蹴 蹶 蹼 躇 軅 轍 轎 辭 邊 醯 鏃 鏈 鏐 鏑 鏖 鏘 鏝 鏡 鏤 鏥 鏨 關 隴 離 霧 霪 靡 鞴 韲 韻 願 顛 餽 餾 饂 騙 騨 髄 鯔 鯖 鯛 鯡 鯢 鯣 鯤 鯨 鯰 鯱 鯲 鯵 鵡 鵬 鵯 鵲 鵺 鶇 鶉 鶏 鹸 麑 麒 麓 麕 麗 黼",
  "20획":
    "嚴 嚶 壤 壥 孀 孃 孅 寶 巉 巌 廰 懸 懺 懽 攘 曦 朧 櫨 櫪 欄 瀰 瀲 瀾 灌 爐 犧 獻 瓏 癢 矍 礦 礫 礬 竇 競 簪 籌 籍 籏 糯 糲 繻 繼 繽 纂 纃 罌 耀 聹 臙 臚 艨 蘖 蘗 蘚 蘯 蘰 蠑 蠕 蠣 襤 襭 覺 觸 譟 譫 譬 譯 議 譱 譲 護 譽 贍 贏 躁 躄 躅 轗 辮 醴 醵 醸 釋 鏗 鐃 鐇 鐐 鐓 鐔 鐘 鐙 鐚 鐡 闡 霰 韜 響 飃 飄 饅 饉 馨 騫 騰 騷 驀 鬪 鰄 鰆 鰈 鰉 鰊 鰌 鰍 鰐 鰒 鰓 鰔 鰕 鰛 鶚 鶤 鶩 鶫 鹹 黥 黨 齟 齠 齡 齣",
  "21획":
    "儷 儺 嚼 囀 囁 囂 囃 囈 囓 屬 巍 廱 懼 懾 攜 攝 曩 櫺 櫻 欅 權 歡 殲 爛 瓔 癧 癨 癩 癪 竈 籃 籐 籔 籖 繿 纈 纉 續 纎 纏 纐 罍 艦 艪 蠡 蠢 襯 譴 贐 贔 躊 躋 躍 轜 轟 辯 醺 鐫 鐵 鐶 鐸 鐺 鑁 闢 闥 露 霸 霹 顧 飆 飜 饋 饌 饐 饑 饒 騾 驂 驃 驅 髏 鬘 魑 魔 鰡 鰤 鰥 鰭 鰮 鰯 鰰 鶯 鶲 鶴 鶸 鶺 鶻 鷁 鷂 鷄 鷆 鷏 麝 黯 齎 齦 齧 龝",
  "22획":
    "儻 儼 囎 巒 巓 彎 懿 攤 灑 灘 疉 疊 癬 禳 穰 竊 竸 籘 籟 籠 糴 纒 罎 羇 聽 聾 臟 艫 蘿 蠧 襲 襴 襷 覽 覿 讀 讃 贓 贖 躑 躓 躔 轡 轢 鑄 鑓 霽 霾 韃 顫 饕 饗 驍 驕 驚 鬚 鬻 鰲 鰺 鰻 鰾 鱆 鱇 鱈 鷓 鷙 齪 齬 龕",
  "23획":
    "巖 戀 攣 攪 攫 欒 癰 籤 籥 纓 纔 纖 罐 蠱 變 讌 讎 讐 躙 軆 轣 轤 邏 鑑 鑒 鑚 鑛 鑞 鑠 鑢 靨 韈 顯 驗 驛 髑 髓 體 髞 鬟 鰹 鱒 鱚 鷦 鷭 鷯 鷲 鷸 黐 黴 齏",
  "24획":
    "囑 癲 矗 纛 羈 艷 蠹 衢 觀 讒 讓 讖 讙 軈 釀 鑪 靂 靄 靆 靈 韆 顰 驟 鬢 魘 鱗 鱠 鱧 鷹 鷺 鷽 麟 鼇 齲 齶 齷",
  "25획": "廳 攬 欝 灣 籬 糶 臠 蠻 覊 躡 釁 鑰 鑵 靉 顱 鬣 鹽 黌 鼈",
  "26획": "欖 矚 蠶 讚 躪 鑷 顴 驢 驥 鬮 鱶 黶",
  "27획": "鑼 鑽 鑾 顳 驤 驩 鱸 黷",
  "28획": "欟 纜 鑿 钁 鸚 鸛",
  "29획": "爨 驪 鬱",
  "30획": "驫 鸞",
};

const BUSHU_KANJI_STRINGS = {
  "一 (いち)":
    "一 丁 七 万 丈 三 上 下 不 与 丐 丑 且 丕 世 丗 丘 丙 丞 両 並 亙 再 弌 歪",
  "｜ (ぼう)": "个 中 丱 串",
  "丶 (てん)": "丶 丸 丹 主 丼 之 氷",
  "丿 (のめ)": "丿 乂 乃 久 乍 乎 乏 乕 乖 乗 乘 兎 及 夷 弗 爽 眉",
  "乙(⺄, 乚) (おつ)": "乙 九 乞 也 乱 乳 乾 亂",
  "亅 (はねぼう)": "亅 了 予 亊 事 豫",
  "二 (に)": "二 于 云 互 五 井 亘 些 亜 亞 亟 弍",
  "亠 (なべぶた)": "亠 亡 亢 交 亥 亦 亨 享 京 亭 亮 亰 亳 亶 烹 牽",
  "人(亻) (ひと(にんべん))":
    "人 什 仁 仂 仄 仆 仇 今 介 仍 从 仏 仔 仕 他 仗 付 仙 仞 仟 代 令 以 仭 仮 仰 仲 件 价 任 企 伉 伊 伍 伎 伏 伐 休 会 伜 伝 伯 估 伴 伶 伸 伺 似 伽 佃 但 佇 位 低 住 佐 佑 体 何 佗 余 佚 佛 作 佝 佩 佯 佰 佳 併 佶 佻 佼 使 侃 來 侈 例 侍 侏 侑 侖 侘 供 依 侠 価 侭 侮 侯 侵 侶 便 係 促 俄 俊 俎 俐 俑 俔 俗 俘 俚 俛 保 俟 信 俣 俤 俥 修 俯 俳 俵 俶 俸 俺 俾 倅 倆 倉 個 倍 們 倒 倔 倖 候 倚 借 倡 倣 値 倥 倦 倨 倩 倪 倫 倬 倭 倶 倹 偃 假 偈 偉 偏 偐 偕 偖 做 停 健 偬 偲 側 偵 偶 偸 偽 傀 傅 傍 傑 傘 備 傚 催 傭 傲 傳 傴 債 傷 傾 僂 僅 僉 僊 働 像 僑 僕 僖 僚 僞 僣 僥 僧 僭 僮 僵 價 僻 儀 儁 儂 億 儉 儒 儔 儕 儖 儘 儚 償 儡 優 儲 儷 儺 儻 儼 全 化 愈 来 禽 舎 舗",
  "儿 (ひとあし)": "儿 兀 允 元 兄 充 兆 兇 先 光 克 兌 免 児 兒 兔 党 兜 兢",
  "入 (いる)": "入 兩 兪",
  "八 (はち)": "八 公 六 兮 共 兵 其 具 典 兼 冀 巽 曽 曾 煎 舅 輿 酋",
  "冂 (えんがまえ)": "冂 内 円 冉 冊 册 冏 冐 冑 冓 冕 囘",
  "冖 (わかんむり)": "冖 冗 写 冠 冢 冤 冥 冦 冨 冩 冪",
  "冫 (にすい)":
    "冫 冬 冰 冱 冲 决 冴 况 冶 冷 冽 凄 凅 准 凉 凋 凌 凍 凛 凜 凝",
  "几 (つくえ)": "几 凡 凧 凩 凪 凭 凰 凱 夙 鳳",
  "凵 (うけばこ)": "凵 凶 凸 凹 出 函 凾",
  "刀(刂) (かたな(りっとう))":
    "刀 刃 刄 分 切 刈 刊 刋 刎 刑 刔 列 初 判 別 刧 利 刪 刮 到 刳 制 刷 券 刹 刺 刻 剃 剄 則 削 剋 剌 前 剏 剔 剖 剛 剞 剣 剤 剥 剩 剪 副 剰 剱 割 剳 剴 創 剽 剿 劃 劇 劈 劉 劍 劑 劒 劔",
  "力 (ちから)":
    "力 功 加 劣 助 努 劫 劬 劭 励 労 劵 効 劼 劾 勁 勃 勅 勇 勉 勍 勒 動 勗 勘 務 勝 勞 募 勠 勢 勣 勤 勦 勧 勲 勳 勵 勸",
  "勹 (つつみがまえ)": "勹 勺 勾 勿 匁 匂 包 匆 匈 匍 匏 匐",
  "匕 (さじのひ)": "匕 北 疑 頃",
  "匚 (はこがまえ)": "匚 匝 匠 匡 匣 匪 匯 匱 匳",
  "匸 (かくしがまえ)": "匸 匹 区 医 匿 區",
  "十 (じゅう)": "十 千 卅 卆 升 午 卉 半 卍 卑 卒 卓 協 南 博 廿 斡",
  "ト (ぼくのと)": "卜 卞 占 卦",
  "卩 (ふしつくり)": "卩 卮 卯 印 危 即 却 卵 卷 卸 卻 卿 夘",
  "厂 (がんだれ)": "厂 厄 厖 厘 厚 原 厠 厥 厦 厨 厩 厭 厮 厰 贋 雁",
  "厶 (む)": "厶 去 参 參 牟",
  "又 (また)": "又 叉 友 双 反 収 叔 取 受 叙 叛 叟 叡 叢",
  "口 (くち)":
    "口 古 句 叨 叩 只 叫 召 叭 叮 可 台 叱 史 右 叶 号 司 叺 吁 吃 各 合 吉 吊 吋 同 名 后 吏 吐 向 君 吝 吟 吠 否 吩 含 听 吭 吮 吶 吸 吹 吻 吼 吽 吾 呀 呂 呆 呈 呉 告 呎 呑 呟 周 呪 呰 呱 味 呵 呶 呷 呻 呼 命 咀 咄 咆 咋 和 咎 咏 咐 咒 咢 咤 咥 咨 咫 咬 咯 咲 咳 咸 咼 咽 咾 哀 品 哂 哄 哇 哈 哉 哘 員 哢 哥 哦 哨 哩 哭 哮 哲 哺 哽 唄 唆 唇 唏 唐 唔 唖 售 唯 唱 唳 唸 唹 唾 啀 啄 啅 商 啌 啓 啖 啗 啜 啝 啣 啻 啼 啾 喀 喃 善 喇 喉 喊 喋 喘 喙 喚 喜 喝 喞 喟 喧 喨 喩 喪 喫 喬 單 喰 嗄 嗅 嗔 嗚 嗜 嗟 嗣 嗤 嗷 嗹 嗽 嗾 嘆 嘉 嘔 嘖 嘗 嘘 嘛 嘩 嘯 嘱 嘲 嘴 嘶 嘸 噂 噌 噎 噐 噛 噤 器 噪 噫 噬 噴 噸 噺 嚀 嚆 嚇 嚊 嚏 嚔 嚠 嚢 嚥 嚮 嚴 嚶 嚼 囀 囁 囂 囃 囈 囎 囑 囓 轡 鳴",
  "囗 (くにがまえ)":
    "嗇 囗 囚 四 回 因 団 囮 困 囲 図 囹 固 国 囿 圀 圃 圄 圈 圉 國 圍 圏 園 圓 圖 團 圜",
  "土 (つち)":
    "土 圦 圧 在 圭 地 圷 圸 圻 址 坂 均 坊 坎 坏 坐 坑 坡 坤 坦 坩 坪 坿 垂 垈 垉 型 垓 垠 垢 垣 垤 垪 垰 垳 埀 埃 埆 埋 城 埒 埓 埔 埖 埜 域 埠 埣 埴 執 培 基 埼 堀 堂 堅 堆 堊 堋 堕 堙 堝 堡 堤 堪 堯 堰 報 場 堵 堺 堽 塀 塁 塊 塋 塑 塒 塔 塗 塘 塙 塚 塞 塢 塩 填 塰 塲 塵 塹 塾 境 墅 墓 増 墜 墟 墨 墫 墮 墳 墸 墹 墺 墻 墾 壁 壅 壇 壊 壌 壑 壓 壕 壗 壘 壙 壜 壞 壟 壤 壥 壷 尭",
  "士 (さむらい)": "士 壯 声 壱 売 壹 壺 壻 壼 壽",
  "夂 (ふゆがしら)": "処 夂 変 粂",
  "夊 (すいにょう)": "夊 夏 夐",
  "夕 (ゆうべ)": "夕 外 多 夛 夜 夢 夥 梦",
  "大 (だい)":
    "大 天 太 夫 夬 夭 央 失 夲 夸 夾 奄 奇 奈 奉 奎 奏 奐 契 奔 奕 套 奘 奚 奠 奢 奥 奧 奨 奩 奪 奬 奮",
  "女 (おんな)":
    "佞 侫 女 奴 奸 好 妁 如 妃 妄 妊 妍 妓 妖 妙 妝 妣 妥 妨 妬 妲 妹 妻 姆 姉 始 姐 姑 姓 委 姙 姚 姜 姥 姦 姨 姪 姫 姶 姻 姿 威 娃 娉 娑 娘 娚 娜 娟 娠 娥 娩 娯 娵 娶 娼 婀 婁 婆 婉 婚 婢 婦 婪 婬 婿 媒 媚 媛 媼 媽 媾 嫁 嫂 嫉 嫋 嫌 嫐 嫖 嫗 嫡 嫣 嫦 嫩 嫺 嫻 嬉 嬋 嬌 嬖 嬢 嬪 嬬 嬰 嬲 嬶 嬾 孀 孃 孅",
  "子 (こへん)":
    "子 孑 孔 孕 字 存 孚 孛 孜 孝 孟 季 孤 孥 学 孩 孫 孰 孱 孳 孵 學 孺",
  "宀 (うかんむり)":
    "宀 它 宅 宇 守 安 宋 完 宍 宏 宕 宗 官 宙 定 宛 宜 宝 実 客 宣 室 宥 宦 宮 宰 害 宴 宵 家 宸 容 宿 寂 寃 寄 寅 密 寇 寉 富 寐 寒 寓 寔 寛 寝 寞 察 寡 寢 寤 寥 實 寧 寨 審 寫 寮 寰 寳 寵 寶 牢 蜜",
  "寸 (すん)": "寸 寺 対 寿 封 専 射 尅 将 將 專 尉 尊 尋 對 導",
  "小(⺌) (しょう(ちいさい))": "小 少 尓 尖 尚 尠 当 耀",
  "尢 (まげあし)": "尢 尤 尨 就",
  "尸 (しかばね)":
    "尸 尹 尺 尻 尼 尽 尾 尿 局 屁 居 屆 屈 届 屋 屍 屎 屏 屐 屑 屓 展 属 屠 屡 層 履 屬 犀",
  "屮 (てつ)": "屮 屯",
  "山 (やま)":
    "乢 妛 山 屶 屹 岌 岐 岑 岔 岡 岨 岩 岫 岬 岱 岳 岶 岷 岸 岻 岼 岾 峅 峇 峙 峠 峡 峨 峩 峪 峭 峯 峰 島 峺 峻 峽 崇 崋 崎 崑 崔 崕 崖 崗 崘 崙 崚 崛 崟 崢 崩 嵋 嵌 嵎 嵐 嵒 嵜 嵩 嵬 嵯 嵳 嵶 嶂 嶄 嶇 嶋 嶌 嶐 嶝 嶢 嶬 嶮 嶷 嶺 嶼 嶽 巉 巌 巍 巒 巓 巖",
  "巛(川) (まがりがわ (さんぼんがわ))": "巛 川 州 巡 順",
  "工 (たくみ)": "工 左 巧 巨 巫 差 攻",
  "己 (おのれ)": "己 已 巳 巴 巵 巷 巻 改",
  "巾 (はば)":
    "巾 市 布 帆 帋 希 帑 帖 帙 帚 帛 帝 帥 師 席 帯 帰 帳 帶 帷 常 帽 幀 幃 幄 幅 幇 幌 幎 幔 幕 幗 幟 幡 幢 幣 幤",
  "干 (ほす)": "干 平 年 幵 并 幸 幹",
  "幺 (いとがしら)": "幺 幻 幼 幽 幾 畿",
  "广 (まだれ)":
    "广 庁 広 庄 庇 床 序 底 庖 店 庚 府 庠 度 座 庫 庭 庵 庶 康 庸 廁 廂 廃 廈 廉 廊 廏 廐 廓 廖 廚 廛 廝 廟 廠 廡 廢 廣 廨 廩 廬 廰 廱 廳",
  "廴 (えんにょう)": "廴 延 廷 廸 建 廻 廼",
  "廾 (にじゅうあし)": "廾 弁 弃 弉 弊",
  "弋 (しきがまえ)": "弋 式 弑 鳶",
  "弓 (ゆみ)":
    "弓 弔 引 弖 弘 弛 弟 弥 弦 弧 弩 弭 弯 弱 張 強 弸 弼 弾 彁 彈 彊 彌 彎 粥",
  "彑 (けいがしら)": "彑 彖 彗 彙 彜 彝",
  "彡 (さんづくり)": "彡 形 彦 彩 彪 彫 彭 彰 影 須",
  "彳 (ぎょうにんべん)":
    "彳 彷 役 彼 彿 往 征 徂 徃 径 待 徇 很 徊 律 後 徐 徑 徒 従 得 徘 徙 從 徠 御 徨 復 循 徭 微 徳 徴 徹 徼 徽",
  "心(忄⺗) (こころ (りっしんべん))":
    "心 必 忌 忍 忖 志 忘 忙 応 忝 忠 忤 快 忰 忱 念 忸 忻 忽 忿 怎 怏 怐 怒 怕 怖 怙 怛 怜 思 怠 怡 急 怦 性 怨 怩 怪 怫 怯 怱 怺 恁 恂 恃 恆 恊 恋 恍 恐 恒 恕 恙 恚 恟 恠 恢 恣 恤 恥 恨 恩 恪 恫 恬 恭 息 恰 恵 恷 悁 悃 悄 悋 悌 悍 悒 悔 悖 悗 悚 悛 悟 悠 患 悦 悧 悩 悪 悲 悳 悴 悵 悸 悼 悽 情 惆 惇 惑 惓 惘 惚 惜 惟 惠 惡 惣 惧 惨 惰 惱 想 惴 惶 惷 惹 惺 惻 愀 愁 愃 愆 愉 愍 愎 意 愕 愚 愛 感 愡 愧 愨 愬 愴 愼 愽 愾 愿 慂 慄 慇 慈 慊 態 慌 慍 慎 慓 慕 慘 慙 慚 慝 慟 慢 慣 慥 慧 慨 慫 慮 慯 慰 慱 慳 慴 慵 慶 慷 慾 憂 憇 憊 憎 憐 憑 憔 憖 憙 憚 憤 憧 憩 憫 憬 憮 憲 憶 憺 憾 懃 懆 懇 懈 應 懊 懋 懌 懍 懐 懣 懦 懲 懴 懶 懷 懸 懺 懼 懽 懾 懿 戀",
  "戈 (かのほこ)":
    "戈 戉 戊 戌 戍 戎 成 我 戒 戔 或 戚 戛 戝 戞 戟 戡 戦 截 戮 戯 戰 戲 戳 戴",
  "戸 (とだれ)": "戸 戻 房 所 扁 扇 扈 扉",
  "手(扌龵) (て(てへん))":
    "手 才 扎 打 払 托 扛 扞 扠 扣 扨 扮 扱 扶 批 扼 找 承 技 抂 抃 抄 抉 把 抑 抒 抓 抔 投 抖 抗 折 抛 抜 択 披 抬 抱 抵 抹 抻 押 抽 拂 担 拆 拇 拈 拉 拊 拌 拍 拏 拐 拑 拒 拓 拔 拗 拘 拙 招 拜 拝 拠 拡 括 拭 拮 拯 拱 拳 拵 拶 拷 拾 拿 持 挂 指 挈 按 挌 挑 挙 挟 挧 挨 挫 振 挺 挽 挾 挿 捉 捌 捍 捏 捐 捕 捗 捜 捧 捨 捩 捫 据 捲 捶 捷 捺 捻 掀 掃 授 掉 掌 掎 掏 排 掖 掘 掛 掟 掠 採 探 掣 接 控 推 掩 措 掫 掬 掲 掴 掵 掻 掾 揀 揃 揄 揆 揉 描 提 插 揖 揚 換 握 揣 揩 揮 援 揶 揺 搆 損 搏 搓 搖 搗 搜 搦 搨 搬 搭 搴 搶 携 搾 摂 摎 摘 摧 摩 摯 摶 摸 摺 撃 撈 撒 撓 撕 撚 撞 撤 撥 撩 撫 播 撮 撰 撲 撹 撻 撼 擁 擂 擅 擇 操 擒 擔 擘 據 擠 擡 擢 擣 擦 擧 擬 擯 擱 擲 擴 擶 擺 擽 擾 攀 攅 攘 攜 攝 攣 攤 攪 攫 攬",
  "支 (しんよう)": "支",
  "攴(攵) (とまた (のぶん))":
    "攴 攵 收 攷 攸 放 政 故 效 敍 敏 救 敕 敖 敗 敘 教 敝 敞 敢 散 敦 敬 数 敲 整 敵 敷 數 斂 斃 變",
  "文 (ぶんにょう)": "文 斈 斌 斐 斑",
  "斗 (とます)": "斗 料 斛 斜 斟",
  "斤 (きん)": "斤 斥 斫 斬 断 斯 新 斷",
  "方 (ほう)": "方 於 施 旁 旃 旄 旅 旆 旋 旌 族 旒 旗 旙 旛",
  "无 (すでのつくり)": "无 旡 既",
  "日 (にち)":
    "匙 日 旦 旧 旨 早 旬 旭 旱 旺 旻 昂 昃 昆 昇 昊 昌 明 昏 易 昔 昜 星 映 春 昧 昨 昭 是 昴 昵 昶 昼 昿 晁 時 晃 晄 晉 晋 晏 晒 晝 晞 晟 晢 晤 晦 晧 晨 晩 普 景 晰 晴 晶 智 暁 暃 暄 暇 暈 暉 暎 暑 暖 暗 暘 暝 暢 暦 暫 暮 暴 暸 暹 暼 暾 曁 曄 曇 曉 曖 曙 曚 曜 曝 曠 曦 曩 杲",
  "曰 (ひらび)": "曰 曲 曳 更 曵 曷 書 曹 曼 替 最 會",
  "月 (つき)": "月 有 朋 服 朏 朕 朖 朗 望 朝 朞 期 朦 朧 霸",
  "木 (き)":
    "彬 木 未 末 本 札 朮 朱 朴 朶 朷 朸 机 朽 朿 杁 杆 杉 李 杏 材 村 杓 杖 杙 杜 杞 束 杠 条 杢 杣 杤 杪 杭 杯 杰 東 杳 杵 杷 杼 松 板 枅 枇 枉 枋 枌 析 枕 林 枚 果 枝 枠 枡 枢 枦 枩 枯 枳 枴 架 枷 枸 枹 柁 柄 柆 柊 柎 柏 某 柑 染 柔 柘 柚 柝 柞 柢 柤 柧 柩 柬 柮 柯 柱 柳 柴 柵 査 柾 柿 栂 栃 栄 栓 栖 栗 栞 校 栢 栩 株 栫 栲 栴 核 根 格 栽 桀 桁 桂 桃 框 案 桍 桎 桐 桑 桓 桔 桙 桜 桝 桟 档 桧 桴 桶 桷 桾 桿 梁 梃 梅 梍 梏 梓 梔 梗 梛 條 梟 梠 梢 梧 梨 梭 梯 械 梱 梳 梵 梶 梹 梺 梼 棄 棆 棉 棊 棋 棍 棒 棔 棕 棗 棘 棚 棟 棠 棡 棣 棧 森 棯 棲 棹 棺 椀 椁 椄 椅 椈 椋 椌 植 椎 椏 椒 椙 椚 椛 検 椡 椢 椣 椥 椦 椨 椪 椰 椴 椶 椹 椽 椿 楊 楓 楔 楕 楙 楜 楝 楞 楠 楡 楢 楪 楫 業 楮 楯 楳 楴 極 楷 楸 楹 楼 楽 楾 榁 概 榊 榎 榑 榔 榕 榛 榜 榠 榧 榮 榱 榲 榴 榻 榾 榿 槁 槃 槇 槊 構 槌 槍 槎 槐 槓 様 槙 槝 槞 槧 槨 槫 槭 槲 槹 槻 槽 槿 樂 樅 樊 樋 樌 樒 樓 樔 樗 標 樛 樞 樟 模 樢 樣 権 横 樫 樮 樵 樶 樸 樹 樺 樽 橄 橇 橈 橋 橘 橙 機 橡 橢 橦 橲 橸 橿 檀 檄 檍 檎 檐 檗 檜 檠 檢 檣 檪 檬 檮 檳 檸 檻 櫁 櫂 櫃 櫑 櫓 櫚 櫛 櫞 櫟 櫨 櫪 櫺 櫻 欄 欅 權 欒 欖 欝 欟 渠",
  "欠 (かける)":
    "欠 次 欣 欧 欲 欷 欸 欹 欺 欽 款 歃 歇 歉 歌 歎 歐 歓 歔 歙 歛 歟 歡",
  "止 (とめる)": "止 正 此 武 歩 歳 歴 歸",
  "歹 (いちた)":
    "歹 死 歿 殀 殃 殄 殆 殉 殊 残 殍 殕 殖 殘 殞 殤 殪 殫 殯 殱 殲",
  "殳 (るまた)": "殳 殴 段 殷 殺 殻 殼 殿 毀 毅 毆",
  "毋 (なかれ)": "毋 母 毎 毒 毓",
  "比 (くらべるひ)": "比 琵",
  "毛 (け)": "毛 毟 毫 毬 毯 毳 氈",
  "氏 (うじ)": "氏 民 氓",
  "气 (きがまえ)": "气 気 氛 氣 氤",
  "水(氵,氺) (みず (さんずい、したみず))":
    "凖 水 永 氾 汀 汁 求 汎 汐 汕 汗 汚 汝 汞 江 池 汢 汨 汪 汰 汲 汳 決 汽 汾 沁 沂 沃 沈 沌 沍 沐 沒 沓 沖 沙 沚 沛 没 沢 沫 沮 沱 河 沸 油 沺 治 沼 沽 沾 沿 況 泄 泅 泉 泊 泌 泓 法 泗 泙 泛 泝 泡 波 泣 泥 注 泪 泯 泰 泱 泳 洋 洌 洒 洗 洙 洛 洞 洟 津 洩 洪 洫 洲 洳 洵 洶 洸 活 洽 派 流 浄 浅 浙 浚 浜 浣 浤 浦 浩 浪 浬 浮 浴 海 浸 浹 涅 消 涌 涎 涓 涕 涙 涛 涜 涯 液 涵 涸 涼 淀 淅 淆 淇 淋 淌 淑 淒 淕 淘 淙 淞 淡 淤 淦 淨 淪 淫 淬 淮 深 淳 淵 混 淹 淺 添 清 渇 済 渉 渊 渋 渓 渕 渙 渚 減 渝 渟 渡 渣 渤 渥 渦 温 渫 測 渭 渮 港 游 渺 渾 湃 湊 湍 湎 湖 湘 湛 湟 湧 湫 湮 湯 湲 湶 湾 湿 満 溂 溌 溏 源 準 溘 溜 溝 溟 溢 溥 溪 溯 溲 溶 溷 溺 溽 滂 滄 滅 滉 滋 滌 滑 滓 滔 滕 滝 滞 滬 滯 滲 滴 滷 滸 滾 滿 漁 漂 漆 漉 漏 漑 漓 演 漕 漠 漢 漣 漫 漬 漱 漲 漸 漾 漿 潁 潅 潔 潘 潛 潜 潟 潤 潦 潭 潮 潯 潰 潴 潸 潺 潼 澀 澁 澂 澄 澆 澎 澑 澗 澡 澣 澤 澪 澱 澳 澹 激 濁 濂 濃 濆 濔 濕 濘 濛 濟 濠 濡 濤 濫 濬 濮 濯 濱 濳 濶 濺 濾 瀁 瀉 瀋 瀏 瀑 瀕 瀘 瀚 瀛 瀝 瀞 瀟 瀦 瀧 瀬 瀰 瀲 瀾 灌 灑 灘 灣 酒",
  "火(灬) (ひへん (れんが))":
    "火 灯 灰 灸 灼 災 炉 炊 炎 炒 炙 炬 炭 炮 炯 炳 炸 点 烈 烋 烏 烙 烝 烟 烱 烽 焉 焔 焙 焚 焜 無 焦 然 焼 煉 煌 煕 煖 煙 煢 煤 煥 煦 照 煩 煬 煮 煽 熄 熈 熊 熏 熔 熕 熙 熟 熨 熬 熱 熹 熾 燃 燈 燉 燎 燐 燒 燔 燕 燗 營 燠 燥 燦 燧 燬 燭 燮 燵 燹 燻 燼 燿 爆 爍 爐 爛 爨",
  "爪 (つめ)": "争 為 爪 爬 爭 爰 爲 爵 舜 采",
  "父 (ちち)": "斧 父 爺",
  "爻 (こう)": "爻 爼 爾",
  "爿 (しょうへん)": "壮 爿 牀 牆 状",
  "片 (かた)": "片 版 牋 牌 牒 牘",
  "牙 (きば)": "牙 邪",
  "牛 (うし)": "牛 牝 牡 牧 物 牲 牴 特 牾 犁 犂 犇 犒 犖 犠 犢 犧",
  "犬(犭) (いぬ(けものへん))":
    "倏 犬 犯 犲 犹 狂 狃 狄 狆 狎 狐 狒 狗 狙 狛 狠 狡 狢 狩 独 狭 狷 狸 狹 狼 狽 猊 猖 猗 猛 猜 猝 猟 猥 猩 猪 猫 献 猯 猴 猶 猷 猾 猿 獄 獅 獎 獏 獗 獣 獨 獪 獰 獲 獵 獸 獺 獻",
  "玄 (げん)": "玄 率",
  "玉 (王) (たまへん)":
    "壬 弄 玉 王 玖 玩 玲 玳 玻 珀 珂 珈 珊 珍 珎 珞 珠 珥 珪 班 珮 珱 珸 現 球 琅 理 琉 琢 琥 琲 琳 琴 琶 琺 琿 瑁 瑕 瑙 瑚 瑛 瑜 瑞 瑟 瑠 瑣 瑤 瑩 瑪 瑯 瑰 瑳 瑶 瑾 璃 璋 璞 璢 璧 環 璽 瓊 瓏 瓔",
  "瓜 (うり)": "瓜 瓠 瓢 瓣",
  "瓦 (かわら)": "瓦 瓧 瓩 瓮 瓰 瓱 瓲 瓶 瓷 瓸 甃 甄 甅 甌 甍 甎 甑 甓 甕",
  "甘 (あまい)": "甘 甚 甞",
  "生 (うまれる)": "生 産 甥 甦",
  "用 (もちいる)": "用 甫 甬",
  "田 (た)":
    "毘 田 由 甲 申 男 甸 町 画 甼 畄 畆 畉 畊 畋 界 畍 畏 畑 畔 留 畚 畛 畜 畝 畠 畢 畤 略 畦 畧 畩 番 畫 畭 異 畳 畴 當 畷 畸 疂 疆 疇 疉 疊 鴫",
  "疋(⺪) (ひき)": "楚 疋 疎 疏 蛋",
  "疒 (やまいだれ)":
    "疔 疚 疝 疣 疥 疫 疱 疲 疳 疵 疸 疹 疼 疽 疾 痂 痃 病 症 痊 痍 痒 痔 痕 痘 痙 痛 痞 痢 痣 痩 痰 痲 痳 痴 痺 痼 痾 痿 瘁 瘉 瘋 瘍 瘟 瘠 瘡 瘢 瘤 瘧 瘰 瘴 瘻 療 癆 癇 癈 癌 癒 癖 癘 癜 癡 癢 癧 癨 癩 癪 癬 癰 癲",
  "癶 (はつがしら)": "癶 癸 発 登 發",
  "白 (しろ)": "白 百 皀 皃 的 皆 皇 皈 皋 皎 皐 皓 皖 皙 皚",
  "皮 (ひのかわ)": "皮 皰 皴 皸 皹 皺 頗",
  "皿 (さら)": "皿 盂 盃 盆 盈 益 盍 盒 盖 盗 盛 盜 盞 盟 盡 監 盤 盥 盧 盪",
  "目 (めへん)":
    "冒 目 盲 直 相 盻 盾 省 眄 眇 眈 看 県 眛 眞 真 眠 眤 眥 眦 眩 眷 眸 眺 眼 睇 睚 睛 睡 督 睥 睦 睨 睫 睹 睾 睿 瞋 瞎 瞑 瞞 瞠 瞥 瞬 瞭 瞰 瞳 瞶 瞹 瞻 瞼 瞽 瞿 矇 矍 矗 矚",
  "矛 (むのほこ)": "矛 矜",
  "矢 (や)": "矢 矣 知 矧 矩 短 矮 矯",
  "石 (いし)":
    "石 矼 砂 砌 砒 研 砕 砠 砥 砦 砧 砲 破 砺 砿 硅 硝 硫 硬 硯 硲 硴 硼 碁 碆 碇 碌 碍 碎 碑 碓 碕 碗 碚 碣 碧 碩 碪 碯 碵 確 碼 碾 磁 磅 磆 磊 磋 磐 磑 磔 磚 磧 磨 磬 磯 磴 磽 礁 礇 礎 礑 礒 礙 礦 礪 礫 礬",
  "示 (礻) (しめす)":
    "示 礼 社 祀 祁 祇 祈 祉 祐 祓 祕 祖 祗 祚 祝 神 祟 祠 祢 祥 票 祭 祷 祺 祿 禀 禁 禄 禅 禊 禍 禎 福 禝 禦 禧 禪 禮 禰 禳",
  "禸 (ぐうのあし)": "禹 禺",
  "禾 (のぎ)":
    "禾 禿 秀 私 秉 秋 科 秒 秕 秘 租 秡 秣 秤 秦 秧 秩 秬 称 移 稀 稈 程 稍 税 稔 稗 稘 稙 稚 稜 稟 稠 種 稱 稲 稷 稻 稼 稽 稾 稿 穀 穂 穃 穆 穉 積 穎 穏 穐 穗 穡 穢 穣 穩 穫 穰 龝",
  "穴 (あな)":
    "穴 究 穹 空 穽 穿 突 窃 窄 窈 窒 窓 窕 窖 窗 窘 窟 窩 窪 窮 窯 窰 窶 窺 窿 竃 竄 竅 竇 竈 竊",
  "立 (たつ)":
    "妾 立 竍 竏 竒 竓 竕 站 竚 竝 竟 章 竡 竢 竣 童 竦 竪 竭 端 竰 競 竸",
  "竹 (⺮) (たけ)":
    "竹 竺 竿 笂 笄 笆 笈 笊 笋 笏 笑 笘 笙 笛 笞 笠 笥 符 笨 第 笳 笵 笶 笹 筅 筆 筈 等 筋 筌 筍 筏 筐 筑 筒 答 策 筝 筥 筧 筬 筮 筰 筱 筴 筵 筺 箆 箇 箋 箍 箏 箒 箔 箕 算 箘 箙 箚 箜 箝 箟 管 箪 箭 箱 箴 箸 節 篁 範 篆 篇 築 篋 篌 篏 篝 篠 篤 篥 篦 篩 篭 篳 篶 篷 簀 簇 簍 簑 簒 簓 簔 簗 簟 簡 簣 簧 簪 簫 簷 簸 簽 簾 簿 籀 籃 籌 籍 籏 籐 籔 籖 籘 籟 籠 籤 籥 籬 纂",
  "米 (こめ)":
    "米 籵 籾 粁 粃 粉 粋 粍 粐 粒 粕 粗 粘 粡 粢 粤 粧 粨 粫 粭 粮 粱 粲 粳 粹 粽 精 糀 糂 糅 糊 糎 糒 糖 糘 糜 糞 糟 糠 糢 糧 糯 糲 糴 糶",
  "糸 (いと)":
    "糸 糺 系 糾 紀 紂 約 紅 紆 紊 紋 納 紐 純 紕 紗 紘 紙 級 紛 紜 素 紡 索 紫 紬 紮 累 細 紲 紳 紵 紹 紺 紿 終 絃 組 絅 絆 絋 経 絎 絏 結 絖 絛 絞 絡 絢 絣 給 絨 絮 統 絲 絳 絵 絶 絹 絽 綉 綏 經 継 続 綛 綜 綟 綢 綣 綫 綬 維 綮 綯 綰 綱 網 綴 綵 綸 綺 綻 綽 綾 綿 緇 緊 緋 総 緑 緒 緕 緘 線 緜 緝 緞 締 緡 緤 編 緩 緬 緯 緲 練 緻 縁 縄 縅 縉 縊 縋 縒 縛 縞 縟 縡 縢 縣 縦 縫 縮 縱 縲 縵 縷 縹 縺 縻 總 績 繁 繃 繆 繊 繋 繍 織 繕 繖 繙 繚 繝 繞 繦 繧 繩 繪 繭 繰 繹 繻 繼 繽 繿 纃 纈 纉 續 纎 纏 纐 纒 纓 纔 纖 纛 纜 辮",
  "缶 (ほとぎ)": "缶 缸 缺 罅 罌 罍 罎 罐",
  "网(⺲,⺳) (あみがしら)":
    "网 罔 罕 罘 罟 罠 罧 罨 罩 罪 罫 置 罰 署 罵 罷 罸 罹 羂 羃 羅 羆 羇 羈",
  "羊(⺶,⺷) (ひつじ)":
    "着 羊 羌 美 羔 羚 羝 羞 羣 群 羨 義 羮 羯 羲 羶 羸 羹 譱",
  "羽 (はね)": "羽 翁 翅 翆 翊 翌 習 翔 翕 翠 翡 翦 翩 翫 翰 翳 翹 翻 翼",
  "老(耂) (おい)": "老 考 耄 者 耆 耋",
  "而 (しかして)": "而 耐",
  "耒 (らいすき)": "耒 耕 耗 耘 耙 耜 耡 耨",
  "耳 (みみ)":
    "耳 耶 耻 耽 耿 聆 聊 聒 聖 聘 聚 聟 聡 聢 聨 聯 聰 聲 聳 聴 聶 職 聹 聽",
  "聿(⺻) (ふでづくり)": "粛 聿 肄 肅 肆 肇",
  "肉(⺼) (にく)":
    "朔 肉 肋 肌 肓 肖 肘 肚 肛 肝 股 肢 肥 肩 肪 肬 肭 肯 肱 育 肴 肺 胃 胄 胆 背 胎 胖 胙 胚 胛 胝 胞 胡 胤 胥 胯 胱 胴 胸 胼 能 脂 脅 脆 脇 脈 脉 脊 脚 脛 脣 脩 脯 脱 脳 脹 脾 腆 腋 腎 腐 腑 腓 腔 腕 腟 腥 腦 腫 腮 腰 腱 腴 腸 腹 腺 腿 膀 膂 膃 膈 膊 膏 膓 膕 膚 膜 膝 膠 膣 膤 膨 膩 膰 膳 膵 膸 膺 膽 膾 膿 臀 臂 臆 臈 臉 臍 臑 臓 臘 臙 臚 臟 臠 鵬",
  "臣 (しん)": "臣 臥 臧 臨",
  "自 (みずから)": "自 臭",
  "至 (いたる)": "至 致 臺 臻",
  "臼 (うす)": "臼 臾 舁 舂 與 興 舉 舊",
  "舌 (した)": "甜 舌 舍 舐 舒 舖 舘",
  "舛 (まいあし)": "舛 舞",
  "舟 (ふね)":
    "舟 舩 航 舫 般 舮 舳 舵 舶 舷 舸 船 艀 艇 艘 艙 艚 艝 艟 艢 艤 艦 艨 艪 艫",
  "艮 (こん)": "艮 良 艱",
  "色 (いろ)": "色 艶 艷",
  "艸 (艹) (くさ(くさがしら))":
    "艸 艾 芋 芍 芒 芙 芝 芟 芥 芦 芫 芬 芭 芯 花 芳 芸 芹 芻 芽 苅 苑 苒 苓 苔 苗 苙 苛 苜 苞 苟 苡 苣 若 苦 苧 苫 英 苳 苴 苹 苺 苻 茂 范 茄 茅 茆 茉 茎 茖 茗 茘 茜 茣 茨 茫 茯 茱 茲 茴 茵 茶 茸 茹 荀 荅 草 荊 荏 荐 荒 荘 荳 荵 荷 荻 荼 莅 莇 莉 莊 莎 莓 莖 莚 莞 莟 莠 莢 莨 莪 莫 莱 莵 莽 菁 菅 菊 菌 菎 菓 菖 菘 菜 菟 菠 菩 菫 華 菰 菱 菲 菴 菷 菻 菽 萃 萄 萇 萋 萌 萍 萎 萓 萠 萢 萩 萪 萬 萱 萵 萸 萼 落 葆 葉 葎 著 葛 葡 葢 董 葦 葩 葫 葬 葭 葮 葯 葱 葵 葷 葹 葺 蒂 蒄 蒋 蒐 蒔 蒙 蒜 蒟 蒡 蒭 蒲 蒸 蒹 蒻 蒼 蒿 蓁 蓄 蓆 蓉 蓊 蓋 蓍 蓐 蓑 蓖 蓙 蓚 蓬 蓴 蓼 蓿 蔀 蔆 蔑 蔓 蔔 蔕 蔗 蔘 蔚 蔟 蔡 蔦 蔬 蔭 蔵 蔽 蕀 蕁 蕃 蕈 蕉 蕊 蕋 蕎 蕕 蕗 蕘 蕚 蕣 蕨 蕩 蕪 蕭 蕷 蕾 薀 薄 薇 薈 薊 薐 薑 薔 薗 薙 薛 薜 薤 薦 薨 薩 薪 薫 薬 薮 薯 薹 薺 藁 藉 藍 藏 藐 藕 藜 藝 藤 藥 藩 藪 藷 藹 藺 藻 藾 蘂 蘆 蘇 蘊 蘋 蘓 蘖 蘗 蘚 蘢 蘭 蘯 蘰 蘿 韮",
  "虍 (とらがしら)": "虍 虎 虐 虔 處 虚 虜 虞 號 虧",
  "虫 (むし)":
    "虫 虱 虹 虻 蚊 蚋 蚌 蚓 蚕 蚣 蚤 蚩 蚪 蚫 蚯 蚰 蚶 蛄 蛆 蛇 蛉 蛍 蛎 蛔 蛙 蛛 蛞 蛟 蛤 蛩 蛬 蛭 蛮 蛯 蛸 蛹 蛻 蛾 蜀 蜂 蜃 蜆 蜈 蜉 蜊 蜍 蜑 蜒 蜘 蜚 蜥 蜩 蜴 蜷 蜻 蜿 蝉 蝋 蝌 蝎 蝓 蝕 蝗 蝙 蝟 蝠 蝣 蝦 蝨 蝪 蝮 蝴 蝶 蝸 蝿 螂 融 螟 螢 螫 螯 螳 螺 螻 螽 蟀 蟄 蟆 蟇 蟋 蟐 蟒 蟠 蟯 蟲 蟶 蟷 蟹 蟻 蟾 蠅 蠍 蠎 蠏 蠑 蠕 蠖 蠡 蠢 蠣 蠧 蠱 蠶 蠹 蠻 雖",
  "血 (ち)": "血 衂 衄 衆",
  "行 (ぎょうがまえ)": "行 衍 衒 術 街 衙 衛 衝 衞 衡 衢",
  "衣(衤) (ころも (ころもへん))":
    "衣 表 衫 衰 衲 衵 衷 衽 衾 衿 袁 袂 袈 袋 袍 袒 袖 袗 袙 袞 袢 袤 被 袮 袰 袱 袴 袵 袷 袿 裁 裂 裃 裄 装 裏 裔 裕 裘 裙 補 裝 裟 裡 裨 裲 裳 裴 裸 裹 裼 製 裾 褂 褄 複 褊 褌 褐 褒 褓 褝 褞 褥 褪 褫 褶 褸 褻 襁 襃 襄 襌 襍 襖 襞 襟 襠 襤 襦 襪 襭 襯 襴 襷",
  "西(覀) (にし)": "粟 襾 西 要 覃 覆 覇 覈 覊",
  "見 (みる)": "見 規 覓 視 覗 覘 覚 覡 覦 覧 覩 親 覬 覯 覲 観 覺 覽 覿 觀",
  "角 (つの)": "角 觚 觜 觝 解 触 觧 觴 觸",
  "言 (ごんべん)":
    "言 訂 訃 計 訊 訌 討 訐 訓 訖 託 記 訛 訝 訟 訣 訥 訪 設 許 訳 訴 訶 診 註 証 詁 詆 詈 詐 詑 詒 詔 評 詛 詞 詠 詢 詣 試 詩 詫 詬 詭 詮 詰 話 該 詳 詼 誂 誄 誅 誇 誉 誌 認 誑 誓 誕 誘 誚 語 誠 誡 誣 誤 誥 誦 誨 説 読 誰 課 誹 誼 調 諂 諄 談 請 諌 諍 諏 諒 論 諚 諛 諜 諞 諠 諡 諢 諤 諦 諧 諫 諭 諮 諱 諳 諷 諸 諺 諾 謀 謁 謂 謄 謇 謌 謎 謐 謔 謖 謗 謙 謚 講 謝 謠 謡 謦 謨 謫 謬 謳 謹 謾 譁 證 譌 譎 譏 譖 識 譚 譛 譜 譟 警 譫 譬 譯 議 譲 譴 護 譽 讀 讃 讌 讎 讐 讒 讓 讖 讙 讚",
  "谷 (たに)": "谷 谺 谿 豁",
  "豆 (まめ)": "豆 豈 豊 豌 豎 豐",
  "豕 (いのこ)": "豕 豚 象 豢 豪 豬",
  "豸 (むじな)": "豸 豹 豺 豼 貂 貅 貉 貊 貌 貍 貎 貔 貘",
  "貝 (かい)":
    "弐 貝 貞 負 財 貢 貧 貨 販 貪 貫 責 貭 貮 貯 貰 貲 貳 貴 貶 買 貸 費 貼 貽 貿 賀 賁 賂 賃 賄 資 賈 賊 賍 賎 賑 賓 賚 賛 賜 賞 賠 賢 賣 賤 賦 質 賭 賺 賻 購 賽 贄 贅 贇 贈 贊 贍 贏 贐 贓 贔 贖 頼",
  "赤 (あか)": "赤 赦 赧 赫 赭",
  "走 (はしる)": "走 赱 赳 赴 起 趁 超 越 趙 趣 趨",
  "足(⻊) (あし (あしへん))":
    "足 趺 趾 跂 跋 跌 跏 跖 跚 跛 距 跟 跡 跣 跨 跪 跫 路 跳 践 跼 跿 踈 踉 踊 踏 踐 踝 踞 踟 踪 踰 踴 踵 蹂 蹄 蹇 蹈 蹉 蹊 蹌 蹐 蹕 蹙 蹟 蹠 蹣 蹤 蹲 蹴 蹶 蹼 躁 躄 躅 躇 躊 躋 躍 躑 躓 躔 躙 躡 躪",
  "身 (みへん)": "身 躬 躯 躰 躱 躾 軅 軆 軈",
  "車 (くるま)":
    "車 軋 軌 軍 軒 軛 軟 転 軣 軫 軸 軻 軼 軽 軾 較 輅 載 輊 輌 輒 輓 輔 輕 輙 輛 輜 輝 輟 輦 輩 輪 輯 輳 輸 輹 輻 輾 轂 轄 轅 轆 轉 轌 轍 轎 轗 轜 轟 轢 轣 轤",
  "辛 (からい)": "辛 辜 辞 辟 辣 辧 辨 辭 辯",
  "辰 (しんのたつ)": "辰 辱 農",
  "⻍(⻌) (しんにょう)":
    "蓮 辷 辺 辻 込 辿 迂 迄 迅 迎 近 返 迚 迢 迥 迦 迩 迪 迫 迭 迯 述 迴 迷 迸 迹 迺 追 退 送 逃 逅 逆 逋 逍 逎 透 逐 逑 逓 途 逕 逖 逗 這 通 逝 逞 速 造 逡 逢 連 逧 逮 週 進 逵 逶 逸 逹 逼 逾 遁 遂 遅 遇 遉 遊 運 遍 過 遏 遐 遑 遒 道 達 違 遖 遘 遙 遜 遞 遠 遡 遣 遥 遨 適 遭 遮 遯 遲 遵 遶 遷 選 遺 遼 遽 避 邀 邁 邂 邃 還 邇 邉 邊 邏 隨",
  "阝 (おおざと (こざとへん))":
    "邑 那 邦 邨 邯 邱 邵 邸 郁 郊 郎 郛 郡 郢 郤 部 郭 郵 郷 都 鄂 鄒 鄙 鄭 鄰 鄲",
  "酉 (とりへん)":
    "酉 酊 酌 配 酎 酔 酖 酘 酢 酣 酥 酩 酪 酬 酲 酳 酵 酷 酸 醂 醇 醉 醋 醍 醐 醒 醗 醜 醢 醤 醪 醫 醯 醴 醵 醸 醺 釀 釁",
  "采 (のごめ)": "悉 釆 釈 釉 釋",
  "里 (さと)": "里 重 野 量 釐",
  "金 (かね)":
    "金 釖 釘 釛 釜 針 釟 釡 釣 釦 釧 釵 釶 釼 釿 鈍 鈎 鈑 鈔 鈕 鈞 鈩 鈬 鈴 鈷 鈿 鉄 鉅 鉈 鉉 鉋 鉐 鉗 鉚 鉛 鉞 鉢 鉤 鉦 鉱 鉾 銀 銃 銅 銑 銓 銕 銖 銘 銚 銛 銜 銭 銷 銹 鋏 鋒 鋤 鋩 鋪 鋭 鋲 鋳 鋸 鋺 鋼 錆 錏 錐 錘 錙 錚 錠 錢 錣 錦 錨 錫 錬 錮 錯 録 錵 錺 錻 鍄 鍋 鍍 鍔 鍖 鍛 鍜 鍠 鍬 鍮 鍵 鍼 鍾 鎌 鎔 鎖 鎗 鎚 鎧 鎬 鎭 鎮 鎰 鎹 鏃 鏈 鏐 鏑 鏖 鏗 鏘 鏝 鏡 鏤 鏥 鏨 鐃 鐇 鐐 鐓 鐔 鐘 鐙 鐚 鐡 鐫 鐵 鐶 鐸 鐺 鑁 鑄 鑑 鑒 鑓 鑚 鑛 鑞 鑠 鑢 鑪 鑰 鑵 鑷 鑼 鑽 鑾 鑿 钁",
  "長 (ながい)": "長",
  "門 (もん)":
    "問 悶 聞 門 閂 閃 閇 閉 閊 開 閏 閑 間 閔 閖 閘 閙 閠 関 閣 閤 閥 閧 閨 閭 閲 閹 閻 閼 閾 闃 闇 闊 闌 闍 闔 闕 闖 闘 關 闡 闢 闥",
  "阜 (阝) (ぎふのふ)":
    "阜 阡 阨 阪 阮 阯 防 阻 阿 陀 陂 附 陋 陌 降 陏 限 陛 陜 陝 陞 陟 院 陣 除 陥 陦 陪 陬 陰 陲 陳 陵 陶 陷 陸 険 陽 隅 隆 隈 隊 隋 隍 階 随 隔 隕 隗 隘 隙 際 障 隠 隣 隧 險 隰 隱 隲 隴",
  "隶 (れいづくり)": "隶 隷 隸",
  "隹 (ふるとり)":
    "隹 隻 隼 雀 雄 雅 集 雇 雉 雋 雌 雍 雎 雑 雕 雙 雛 雜 離 難",
  "雨 (あめ)":
    "雨 雪 雫 雰 雲 零 雷 雹 電 需 霄 霆 震 霈 霊 霍 霎 霏 霑 霓 霖 霙 霜 霞 霤 霧 霪 霰 露 霹 霽 霾 靂 靄 靆 靈 靉",
  "青 (あお)": "青 靖 静 靜",
  "非 (あらず)": "非 靠 靡",
  "面 (めん)": "面 靤 靦 靨",
  "革 (かくのかわ)":
    "革 靫 靭 靱 靴 靹 靺 靼 鞁 鞄 鞅 鞆 鞋 鞍 鞏 鞐 鞘 鞜 鞠 鞣 鞦 鞨 鞫 鞭 鞳 鞴 韃 韆 韈",
  "韋 (なめしがわ)": "韋 韓 韜",
  "韭 (にら)": "韭 韲",
  "音 (おと)": "音 韵 韶 韻 響",
  "頁 (おおがい)":
    "頁 頂 項 頌 頏 預 頑 頒 頓 領 頚 頡 頤 頬 頭 頴 頷 頸 頻 頽 顆 顋 題 額 顎 顏 顔 顕 願 顛 類 顧 顫 顯 顰 顱 顳 顴",
  "風 (かぜ)": "風 颪 颯 颱 颶 飃 飄 飆",
  "飛 (とぶ)": "飛 飜",
  "食 (しょくへん)":
    "食 飢 飩 飫 飭 飮 飯 飲 飴 飼 飽 飾 餃 餅 餉 養 餌 餐 餒 餓 餔 餘 餝 餞 餠 餡 餤 館 餬 餮 餽 餾 饂 饅 饉 饋 饌 饐 饑 饒 饕 饗",
  "首 (くび)": "首 馗 馘",
  "香 (においこう)": "香 馥 馨",
  "馬 (うま)":
    "馬 馭 馮 馳 馴 馼 駁 駄 駅 駆 駈 駐 駑 駒 駕 駘 駛 駝 駟 駢 駭 駮 駱 駲 駸 駻 駿 騁 騅 騎 騏 騒 験 騙 騨 騫 騰 騷 騾 驀 驂 驃 驅 驍 驕 驗 驚 驛 驟 驢 驤 驥 驩 驪 驫",
  "骨 (ほね)": "骨 骭 骰 骸 骼 髀 髄 髏 髑 髓 體",
  "高 (たかい)": "高 髞",
  "髟 (かみがしら)": "髟 髢 髣 髦 髪 髫 髭 髮 髯 髱 髴 髷 髻 鬆 鬘 鬚 鬟 鬢 鬣",
  "鬥 (とうがまえ)": "鬥 鬧 鬨 鬩 鬪 鬮",
  "鬯 (ちょう)": "鬯 鬱",
  "鬲 (かく)": "鬲 鬻",
  "鬼 (おに)": "鬼 魁 魂 魃 魄 魅 魍 魎 魏 魑 魔 魘",
  "魚 (うお)":
    "魚 魯 魴 鮃 鮎 鮑 鮒 鮓 鮖 鮗 鮟 鮠 鮨 鮪 鮫 鮭 鮮 鮴 鮹 鯀 鯆 鯉 鯊 鯏 鯑 鯒 鯔 鯖 鯛 鯡 鯢 鯣 鯤 鯨 鯰 鯱 鯲 鯵 鰄 鰆 鰈 鰉 鰊 鰌 鰍 鰐 鰒 鰓 鰔 鰕 鰛 鰡 鰤 鰥 鰭 鰮 鰯 鰰 鰲 鰹 鰺 鰻 鰾 鱆 鱇 鱈 鱒 鱗 鱚 鱠 鱧 鱶 鱸",
  "鳥 (とり)":
    "鳥 鳧 鳩 鳫 鳬 鳰 鴃 鴆 鴇 鴈 鴉 鴎 鴒 鴕 鴛 鴟 鴣 鴦 鴨 鴪 鴬 鴻 鴾 鴿 鵁 鵄 鵆 鵈 鵐 鵑 鵙 鵜 鵝 鵞 鵠 鵡 鵤 鵯 鵲 鵺 鶇 鶉 鶏 鶚 鶤 鶩 鶫 鶯 鶲 鶴 鶸 鶺 鶻 鷁 鷂 鷄 鷆 鷏 鷓 鷙 鷦 鷭 鷯 鷲 鷸 鷹 鷺 鷽 鸚 鸛 鸞",
  "鹵 (ろ)": "鹵 鹸 鹹 鹽",
  "鹿 (しか)": "鹿 麁 麈 麋 麌 麑 麒 麓 麕 麗 麝 麟",
  "麦 (むぎ)": "麥 麦 麩 麪 麭 麸 麹 麺",
  "麻 (あさ)": "麻 麼 麾 麿",
  "黄 (きいろ)": "黄 黌",
  "黍 (きび)": "黍 黎 黏 黐",
  "黒 (くろ)": "黒 黔 默 黙 黛 黜 黝 點 黠 黥 黨 黯 黴 黶 黷",
  "黹 (ふつ)": "黹 黻 黼",
  "黽 (べん)": "黽 鼇 鼈",
  "鼎 (かなえ)": "鼎",
  "鼓 (つづみ)": "皷 鼓 鼕",
  "鼠 (ねずみ)": "鼠 鼡 鼬",
  "鼻 (はな)": "鼻 鼾",
  "斉 (せい)": "斉 斎 齊 齋 齎 齏",
  "歯 (は)": "歯 齒 齔 齟 齠 齡 齢 齣 齦 齧 齪 齬 齲 齶 齷",
  "龍 (りゅう)": "竜 聾 襲 龍 龕",
  "亀 (かめ)": "亀 龜",
  "龠 (やく)": "龠",
  "⺍ (つかんむり)": "単 厳 営 巣",
};

const SHINBUN_KANJI_STRINGS = {
  "1위~99위":
    "日 一 国 会 人 年 大 十 二 本 中 長 出 三 同 時 政 事 自 行 社 見 月 分 議 後 前 民 生 連 五 発 間 対 上 部 東 者 党 地 合 市 業 内 相 方 四 定 今 回 新 場 金 員 九 入 選 立 開 手 米 力 学 問 高 代 明 実 円 関 決 子 動 京 全 目 表 戦 経 通 外 最 言 氏 現 理 調 体 化 田 当 八 六 約 主 題 下 首 意",
  "100위~199위":
    "法 不 来 作 性 的 要 用 制 治 度 務 強 気 小 七 成 期 公 持 野 協 取 都 和 統 以 機 平 総 加 山 思 家 話 世 受 区 領 多 県 続 進 正 安 設 保 改 数 記 院 女 初 北 午 指 権 心 界 支 第 産 結 百 派 点 教 報 済 書 府 活 原 先 共 得 解 名 交 資 予 川 向 際 査 勝 面 委 告 軍 文 反 元 重 近 千 考 判 認 画",
  "200위~299위":
    "海 参 売 利 組 知 案 道 信 策 集 在 件 団 別 物 側 任 引 使 求 所 次 水 半 品 昨 論 計 死 官 増 係 感 特 情 投 示 変 打 男 基 私 各 始 島 直 両 朝 革 価 式 確 村 提 運 終 挙 果 西 勢 減 台 広 容 必 応 演 電 歳 住 争 談 能 無 再 位 置 企 真 流 格 有 疑 口 過 局 少 放 税 検 藤 町 常 校 料 沢 裁 状 工",
  "300위~399위":
    "建 語 球 営 空 職 証 土 与 急 止 送 援 供 可 役 構 木 割 聞 身 費 付 施 切 由 説 転 食 比 難 防 補 車 優 夫 研 収 断 井 何 南 石 足 違 消 境 神 番 規 術 護 展 態 導 鮮 備 宅 害 配 副 算 視 条 幹 独 警 宮 究 育 席 輸 訪 楽 起 万 着 乗 店 述 残 想 線 率 病 農 州 武 声 質 念 待 試 族 象 銀 域 助 労 例",
  "400위~499위":
    "衛 然 早 張 映 限 親 額 監 環 験 追 審 商 葉 義 伝 働 形 景 落 欧 担 好 退 準 賞 訴 辺 造 英 被 株 頭 技 低 毎 医 復 仕 去 姿 味 負 閣 韓 渡 失 移 差 衆 個 門 写 評 課 末 守 若 脳 極 種 美 岡 影 命 含 福 蔵 量 望 松 非 撃 佐 核 観 察 整 段 横 融 型 白 深 字 答 夜 製 票 況 音 申 様 財 港 識 注 呼 渉",
  "500위~599위":
    "達 良 響 阪 帰 針 専 推 谷 古 候 史 天 階 程 満 敗 管 値 歌 買 突 兵 接 請 器 士 光 討 路 悪 科 攻 崎 督 授 催 細 効 図 週 積 丸 他 及 湾 録 処 省 旧 室 憲 太 橋 歩 離 岸 客 風 紙 激 否 周 師 摘 材 登 系 批 郎 母 易 健 黒 火 戸 速 存 花 春 飛 殺 央 券 赤 号 単 盟 座 青 破 編 捜 竹 除 完 降 超 責 並",
  "600위~699위":
    "療 従 右 修 捕 隊 危 採 織 森 競 拡 故 館 振 給 屋 介 読 弁 根 色 友 苦 就 迎 走 販 園 具 左 異 歴 辞 将 秋 因 献 厳 馬 愛 幅 休 維 富 浜 父 遺 彼 般 未 塁 貿 講 邦 舞 林 装 諸 夏 素 亡 劇 河 遣 航 抗 冷 模 雄 適 婦 鉄 寄 益 込 顔 緊 類 児 余 禁 印 逆 王 返 標 換 久 短 油 妻 暴 輪 占 宣 背 昭 廃 植",
  "700위~799위":
    "熱 宿 薬 伊 江 清 習 険 頼 僚 覚 吉 盛 船 倍 均 億 途 圧 芸 許 皇 臨 踏 駅 署 抜 壊 債 便 伸 留 罪 停 興 爆 陸 玉 源 儀 波 創 障 継 筋 狙 帯 延 羽 努 固 闘 精 則 葬 乱 避 普 散 司 康 測 豊 洋 静 善 逮 婚 厚 喜 齢 囲 卒 迫 略 承 浮 惑 崩 順 紀 聴 脱 旅 絶 級 幸 岩 練 押 軽 倒 了 庁 博 城 患 締 等 救",
  "800위~899위":
    "執 層 版 老 令 角 絡 損 房 募 曲 撤 裏 払 削 密 庭 徒 措 仏 績 築 貨 志 混 載 昇 池 陣 我 勤 為 血 遅 抑 幕 居 染 温 雑 招 奈 季 困 星 傷 永 択 秀 著 徴 誌 庫 弾 償 刊 像 功 拠 香 欠 更 秘 拒 刑 坂 刻 底 賛 塚 致 抱 繰 服 犯 尾 描 布 恐 寺 鈴 盤 息 宇 項 喪 伴 遠 養 懸 戻 街 巨 震 願 絵 希 越 契 掲",
  "900위~999위":
    "躍 棄 欲 痛 触 邸 依 籍 汚 縮 還 枚 属 笑 互 複 慮 郵 束 仲 栄 札 枠 似 夕 恵 板 列 露 沖 探 逃 借 緩 節 需 骨 射 傾 届 曜 遊 迷 夢 巻 購 揮 君 燃 充 雨 閉 緒 跡 包 駐 貢 鹿 弱 却 端 賃 折 紹 獲 郡 併 草 徹 飲 貴 埼 衝 焦 奪 雇 災 浦 暮 替 析 預 焼 簡 譲 称 肉 納 樹 挑 章 臓 律 誘 紛 貸 至 宗 促 慎",
  "1000위~1099위":
    "控 贈 智 握 照 宙 酒 俊 銭 薄 堂 渋 群 銃 悲 秒 操 携 奥 診 詰 託 晴 撮 誕 侵 括 掛 謝 双 孝 刺 到 駆 寝 透 津 壁 稲 仮 暗 裂 敏 鳥 純 是 飯 排 裕 堅 訳 盗 芝 綱 吸 典 賀 扱 顧 弘 看 訟 戒 祉 誉 歓 勉 奏 勧 騒 翌 陽 閥 甲 快 縄 片 郷 敬 揺 免 既 薦 隣 悩 華 泉 御 範 隠 冬 徳 皮 哲 漁 杉 里 釈 己 荒",
  "1100위~1199위":
    "貯 硬 妥 威 豪 熊 歯 滞 微 隆 埋 症 暫 忠 倉 昼 茶 彦 肝 柱 喚 沿 妙 唱 祭 袋 阿 索 誠 忘 襲 雪 筆 吹 訓 懇 浴 俳 童 宝 柄 驚 麻 封 胸 娘 砂 李 塩 浩 誤 剤 瀬 趣 陥 斎 貫 仙 慰 賢 序 弟 旬 腕 兼 聖 旨 即 洗 柳 舎 偽 較 覇 兆 床 畑 慣 詳 毛 緑 尊 抵 脅 祝 礼 窓 柔 茂 犠 旗 距 雅 飾 網 竜 詩 昔 繁 殿",
  "1200위~1299위":
    "濃 翼 牛 茨 潟 敵 魅 嫌 魚 斉 液 貧 敷 擁 衣 肩 圏 零 酸 兄 罰 怒 滅 泳 礎 腐 祖 幼 脚 菱 荷 潮 梅 泊 尽 杯 僕 桜 滑 孤 黄 煕 炎 賠 句 寿 鋼 頑 甘 臣 鎖 彩 摩 浅 励 掃 雲 掘 縦 輝 蓄 軸 巡 疲 稼 瞬 捨 皆 砲 軟 噴 沈 誇 祥 牲 秩 帝 宏 唆 鳴 阻 泰 賄 撲 凍 堀 腹 菊 絞 乳 煙 縁 唯 膨 矢 耐 恋 塾 漏 紅",
  "1300위~1399위":
    "慶 猛 芳 懲 郊 剣 腰 炭 踊 幌 彰 棋 丁 冊 恒 眠 揚 冒 之 勇 曽 械 倫 陳 憶 怖 犬 菜 耳 潜 珍 梨 仁 克 岳 概 拘 墓 黙 須 偏 雰 卵 遇 湖 諮 狭 喫 卓 干 頂 虫 刷 亀 糧 梶 湯 箱 簿 炉 牧 殊 殖 艦 溶 輩 穴 奇 慢 鶴 謀 暖 昌 拍 朗 丈 鉱 寛 覆 胞 泣 涙 隔 浄 匹 没 暇 肺 孫 貞 靖 鑑 飼 陰 銘 鋭 随 烈 尋 渕",
  "1400위~1499위":
    "稿 枝 丹 啓 也 丘 棟 壌 漫 玄 粘 悟 舗 妊 塗 熟 軒 旭 恩 毒 騰 往 豆 遂 晩 狂 叫 栃 岐 陛 緯 培 衰 艇 屈 径 淡 抽 披 廷 錦 准 暑 拝 磯 奨 妹 浸 剰 胆 氷 繊 駒 乾 虚 棒 寒 孜 霊 帳 悔 諭 祈 惨 虐 翻 墜 沼 据 肥 徐 糖 搭 姉 髪 忙 盾 脈 滝 拾 軌 俵 妨 盧 粉 擦 鯨 漢 糸 荘 諾 雷 漂 懐 勘 綿 栽 才 拐 笠",
  "1500위~1599위":
    "駄 添 汗 冠 斜 銅 鏡 聡 浪 亜 覧 詐 壇 勲 魔 酬 紫 湿 曙 紋 卸 奮 趙 欄 逸 涯 拓 眼 瓶 獄 筑 尚 阜 彫 咲 穏 顕 巧 矛 垣 召 欺 釣 缶 萩 粧 隻 葛 脂 粛 栗 愚 蒸 嘉 遭 架 篠 鬼 庶 肌 稚 靴 菅 滋 幻 煮 姫 誓 耕 把 践 呈 疎 仰 鈍 恥 剛 疾 征 砕 謡 嫁 謙 后 嘆 俣 菌 鎌 巣 泥 頻 琴 班 淵 棚 潔 酷 宰 廊 寂",
  "1600위~1699위":
    "辰 隅 偶 霞 伏 灯 柏 辛 磨 碁 俗 漠 邪 晶 辻 麦 墨 鎮 洞 履 劣 那 殴 娠 奉 憂 朴 亭 姓 淳 荻 筒 鼻 嶋 怪 粒 詞 鳩 柴 偉 酔 惜 穫 佳 潤 悼 乏 胃 該 赴 桑 桂 髄 虎 盆 晋 穂 壮 堤 飢 傍 疫 累 痴 搬 畳 晃 癒 桐 寸 郭 机 尿 凶 吐 宴 鷹 賓 虜 膚 陶 鐘 憾 畿 猪 紘 磁 弥 昆 粗 訂 芽 尻 庄 傘 敦 騎 寧 濯 循",
  "1700위~1799위":
    "忍 磐 猫 怠 如 寮 祐 鵬 塔 沸 鉛 珠 凝 苗 獣 哀 跳 灰 匠 菓 垂 蛇 澄 縫 僧 幾 眺 唐 亘 呉 凡 憩 鄭 芦 龍 媛 溝 恭 刈 睡 錯 伯 帽 笹 穀 柿 陵 霧 魂 枯 弊 釧 妃 舶 餓 腎 窮 掌 麗 綾 臭 釜 悦 刃 縛 暦 宜 盲 粋 辱 毅 轄 猿 弦 嶌 稔 窒 炊 洪 摂 飽 函 冗 涼 桃 狩 舟 貝 朱 渦 紳 枢 碑 鍛 刀 鼓 裸 鴨 符 猶",
  "1800위~1899위":
    "塊 旋 弓 幣 膜 扇 脇 腸 憎 槽 鍋 慈 皿 肯 樋 楊 伐 駿 漬 燥 糾 亮 墳 坪 畜 紺 慌 娯 吾 椿 舌 羅 坊 峡 俸 厘 峰 圭 醸 蓮 弔 乙 倶 汁 尼 遍 堺 衡 呆 薫 瓦 猟 羊 窪 款 閲 雀 偵 喝 敢 畠 胎 酵 憤 豚 遮 扉 硫 赦 挫 挟 窃 泡 瑞 又 慨 紡 恨 肪 扶 戯 伍 忌 濁 奔 斗 蘭 蒲 迅 肖 鉢 朽 殻 享 秦 茅 藩 沙 輔 曇",
  "1900위~1999위":
    "媒 鶏 禅 嘱 胴 粕 冨 迭 挿 湘 嵐 椎 灘 堰 獅 姜 絹 陪 剖 譜 郁 悠 淑 帆 暁 鷲 傑 楠 笛 芥 其 玲 奴 誰 錠 拳 翔 遷 拙 侍 尺 峠 篤 肇 渇 榎 俺 劉 幡 諏 叔 雌 亨 堪 叙 酢 吟 逓 痕 嶺 袖 甚 喬 崔 妖 琵 琶 聯 蘇 闇 崇 漆 岬 癖 愉 寅 捉 礁 乃 洲 屯 樽 樺 槙 薩 姻 巌 淀 麹 賭 擬 塀 唇 睦 閑 胡 幽 峻 曹 哨",
  "2000위~2099위":
    "詠 炒 屏 卑 侮 鋳 抹 尉 槻 隷 禍 蝶 酪 茎 汎 頃 帥 梁 逝 滴 汽 謎 琢 箕 匿 爪 芭 逗 苫 鍵 襟 蛍 楢 蕉 兜 寡 琉 痢 庸 朋 坑 姑 烏 藍 僑 賊 搾 奄 臼 畔 遼 唄 孔 橘 漱 呂 桧 拷 宋 嬢 苑 巽 杜 渓 翁 藝 廉 牙 謹 瞳 湧 欣 窯 褒 醜 魏 篇 升 此 峯 殉 煩 巴 禎 枕 劾 菩 堕 丼 租 檜 稜 牟 桟 榊 錫 荏 惧 倭 婿",
  "2100위~2199위":
    "慕 廟 銚 斐 罷 矯 某 囚 魁 薮 虹 鴻 泌 於 赳 漸 逢 凧 鵜 庵 膳 蚊 葵 厄 藻 萬 禄 孟 鴈 狼 嫡 呪 斬 尖 翫 嶽 尭 怨 卿 串 已 嚇 巳 凸 暢 腫 粟 燕 韻 綴 埴 霜 餅 魯 硝 牡 箸 勅 芹 杏 迦 棺 儒 鳳 馨 斑 蔭 焉 慧 祇 摯 愁 鷺 楼 彬 袴 匡 眉 苅 讃 尹 欽 薪 湛 堆 狐 褐 鴎 瀋 挺 賜 嵯 雁 佃 綜 繕 狛 壷 橿 栓",
  "2200위~2299위":
    "翠 鮎 芯 蜜 播 榛 凹 艶 帖 伺 桶 惣 股 匂 鞍 蔦 玩 萱 梯 雫 絆 錬 湊 蜂 隼 舵 渚 珂 煥 衷 逐 斥 稀 癌 峨 嘘 旛 篭 芙 詔 皐 雛 娼 篆 鮫 椅 惟 牌 宕 喧 佑 蒋 樟 耀 黛 叱 櫛 渥 挨 憧 濡 槍 宵 襄 妄 惇 蛋 脩 笘 宍 甫 酌 蚕 壕 嬉 囃 蒼 餌 簗 峙 粥 舘 銕 鄒 蜷 暉 捧 頒 只 肢 箏 檀 鵠 凱 彗 謄 諌 樫 噂 脊",
  "2300위~2399위":
    "牝 梓 洛 醍 砦 丑 笏 蕨 噺 抒 嗣 隈 叶 凄 汐 絢 叩 嫉 朔 蔡 膝 鍾 仇 伽 夷 恣 瞑 畝 抄 杭 寓 麺 戴 爽 裾 黎 惰 坐 鍼 蛮 塙 冴 旺 葦 礒 咸 萌 饗 歪 冥 偲 壱 瑠 韮 漕 杵 薔 膠 允 眞 蒙 蕃 呑 侯 碓 茗 麓 瀕 蒔 鯉 竪 弧 稽 瘤 澤 溥 遥 蹴 或 訃 矩 厦 冤 剥 舜 侠 贅 杖 蓋 畏 喉 汪 猷 瑛 搜 曼 附 彪 撚 噛",
  "2400위~2499위":
    "卯 桝 撫 喋 但 溢 闊 藏 浙 彭 淘 剃 揃 綺 徘 巷 竿 蟹 芋 袁 舩 拭 茜 凌 頬 厨 犀 簑 皓 甦 洸 毬 檄 姚 蛭 婆 叢 椙 轟 贋 洒 貰 儲 緋 貼 諜 鯛 蓼 甕 喘 怜 溜 邑 鉾 倣 碧 燈 諦 煎 瓜 緻 哺 槌 啄 穣 嗜 偕 罵 酉 蹄 頚 胚 牢 糞 悌 吊 楕 鮭 乞 倹 嗅 詫 鱒 蔑 轍 醤 惚 廣 藁 柚 舛 縞 謳 杞 鱗 繭 釘 弛 狸 壬",
  "2500위~2599위": "硯 蝦",
};

const JINMEIYOU_KANJI_STRINGS = {
  "일본 인명용 한자 (통상)":
    "丑 丞 乃 之 乎 也 云 亘 亙 些 亥 亦 亨 亮 仔 伊 伍 伶 伽 佃 佑 侃 侑 俄 俐 俣 倖 倦 倭 偲 傭 儲 允 兎 兜 其 冴 凌 凛 凜 凧 凪 凰 凱 函 劉 劫 勁 勿 匡 卜 卯 卿 厨 厩 叉 叡 叢 只 叶 吻 吾 哉 哨 哩 啄 喋 喧 喬 喰 嘉 嘗 嘩 噂 噌 圃 圭 坐 坦 埴 堯 堰 堵 堺 塙 壕 壬 夷 奄 奎 套 姥 姪 娃 娩 嬉 孜 孟 宋 宏 宕 宥 寅 寓 寵 尖 尤 尭 屑 峨 峻 崚 嵩 嵯 嶺 巌 巖 已 巳 巴 巷 巽 帖 幌 幡 庄 庇 庚 庵 廟 廻 廿 弘 弛 彗 彦 彪 彬 徠 徽 忽 怜 恕 恢 恰 悉 悌 惇 惚 惟 惣 惹 惺 慧 憐 戊 或 戟 托 按 挺 挽 捧 捲 捷 捺 掠 掬 揃 摺 撒 撞 撫 播 撰 擢 敦 斐 斡 斧 斯 於 旭 昂 昊 昌 昏 昴 晃 晄 晋 晏 晒 晟 晦 晨 智 暉 暢 曙 曝 曳 朋 朔 李 杏 杖 杜 杭 杵 杷 枇 柊 柏 柑 柘 柚 柴 柾 栖 栗 栞 桂 桐 桔 桧 桶 梁 梓 梛 梢 梧 梯 梶 棲 椀 椋 椛 椰 椿 楊 楓 楕 楚 楠 楢 楯 榊 榎 榛 槇 槌 槍 槙 槻 樋 樟 樫 樺 樽 橘 橙 檀 檎 檜 櫂 櫓 櫛 欣 欽 歎 此 殆 毅 毘 毬 汀 汐 汝 汲 沌 沓 沫 洛 洲 洵 洸 浩 浬 淀 淋 淳 淵 渚 渥 湊 湘 湛 溜 溢 滉 漕 漣 漱 澪 濡 瀕 灘 灸 灼 烏 焚 煉 煌 煤 熙 燎 燕 燦 燭 燿 爾 牒 牟 牡 牽 犀 狼 猪 獅 玖 玲 珀 珂 珈 珊 琉 琢 琥 琳 琵 琶 瑚 瑛 瑞 瑳 瑶 瓜 瓢 甥 甫 畠 畢 疋 疏 皐 皓 眸 瞥 矩 砥 砦 砧 硯 碓 碗 碧 碩 磐 磯 祁 祇 祐 祢 祷 祿 禄 禎 禰 禽 禾 秤 秦 稀 稔 稜 稟 穣 穰 穹 穿 窄 窪 窺 竣 竪 竺 竿 笈 笙 笠 笹 筈 筑 箔 箕 篇 篠 簾 籾 粟 粥 糊 紐 紗 紘 紬 絃 絆 絢 綜 綴 綸 綺 綾 緋 縞 纂 纏 羚 翔 翠 耀 而 耶 耽 聡 肇 肋 肴 胡 胤 脩 腔 膏 臥 舜 舵 芙 芥 芦 芭 芹 苑 苔 苺 茄 茅 茉 茜 茸 荻 莉 莞 莫 菅 菖 菩 菫 菱 萄 萌 萠 萩 萱 葡 董 葦 葵 葺 蒐 蒔 蒙 蒲 蒼 蓉 蓑 蓬 蓮 蔓 蔦 蔭 蕃 蕉 蕎 蕗 蕨 蕪 蕾 薙 薩 藁 蘇 蘭 蝦 蝶 螺 蟹 衿 袈 袴 裟 裡 裳 襖 訊 訣 註 詢 詫 誼 諄 諏 諒 諺 謂 讃 豹 貰 賑 赳 跨 蹄 蹟 輔 輯 輿 轟 辰 辻 辿 迂 迄 迦 迪 逗 這 逞 逢 遁 遙 遥 遼 邑 郁 鄭 酉 醇 醍 醐 釉 釘 釧 鋒 鋸 錆 錐 錫 鍬 鎧 閃 閏 閤 阿 陀 隈 隼 雀 雁 雛 雫 霞 靖 鞄 鞍 鞘 鞠 鞭 頁 頌 頗 颯 饗 馨 馳 馴 駕 駿 驍 魁 魯 鮎 鯉 鯛 鰯 鱒 鱗 鳩 鳳 鳶 鴨 鴻 鵜 鵬 鷲 鷹 鷺 麒 麟 麿 黎 黛 鼎",
  "일본 인명용 한자 (특수)":
    "乘 亞 佛 來 傳 僞 價 儉 兒 冨 凉 剩 劍 勳 卷 單 嚴 圈 國 圓 團 埜 壘 壞 壯 壽 奧 奬 孃 寢 實 將 專 峯 峽 嶋 帶 廣 廳 彈 彌 從 恆 惠 惡 愼 應 懷 戰 戲 拂 拔 拜 搖 搜 攝 收 敍 晝 曉 曾 條 榮 樂 樣 檢 櫻 氣 淨 滯 澁 濕 瀧 燈 燒 爭 爲 狹 獸 疊 盃 盜 盡 眞 碎 祕 禪 禮 稻 穗 粹 縣 縱 纖 聽 臟 與 莊 萬 薗 藏 藝 藥 衞 裝 覽 謠 讓 賣 轉 醉 釀 鎭 鑄 陷 險 雜 靜 顯 飜 駈 騷 驗 髮 鷄 默 齊 龍",
};
